[
    {
        "article_id": 0,
        "rss_id": 0,
        "title": "Welcome to Byte-Bite",
        "summary": "Take a bite out of the news and updates with ByteBite, the bite-sized RSS feed reader that delivers all the essential  news in a pocket-size format.",
        "article_link": "",
        "pub_date": "2023-03-23T12:00:00Z",
        "created_at": "2023-03-23T12:00:00Z"
    },
    {
        "article_id": 1,
        "rss_id": 1,
        "title": "IMA calls nationwide protest against Rajasthan's Right to Health Act",
        "summary": "Rajasthan assembly has recently passed the Right to Health Bill which protects the rights of patients to access equitable healthcare services.",
        "article_link": "",
        "pub_date": "2023-03-25T17:43:11.420334700Z",
        "created_at": "2023-03-25T17:43:11.420334700Z"
    },
    {
        "article_id": 2,
        "rss_id": 2,
        "title": "Amritpal Singh's 'Khalistan blueprint'; Khalistani currency and map found in aide's phone",
        "summary": "More details have emerged of Khalistani Leader Amritpal Singh's 'Khalistan revival plot.' The fugitive leader of the 'Waris De Punjab' outfit had allegedly designed and even printed 'Khalistan' currency and was building a private army. The Punjab Police have recovered and released incriminating material from a phone seized from From Amritpal's alleged gunman Tajinder Singh Gill. Find out more in this video. Hindustan Times, owned by HT Media Ltd, is one of India’s largest publications that provides unbiased news, analysis and features on politics, sports, entertainment, lifestyle and more. Hindustan Times delivers the news across all social media platforms, on the web, and at your doorstep.",
        "article_link": "",
        "pub_date": "2023-03-25T17:43:11.420334700Z",
        "created_at": "2023-03-25T17:43:11.422177700Z"
    },
    {
        "article_id": 3,
        "rss_id": 1,
        "title": "Zakir Naik targets Modi Govt in Oman; Makes this big claim over Indian Hindus | 'Vote Bank'",
        "summary": "Fugitive Islamic preacher and IRF president Dr Zakir Naik has targeted Modi Govt from Oman and claimed that Indian Hindus love him which is disliked by the Government as it creates problems for its \"vote bank\". Naik also boasted of Hindu participation in his Islamic lectures in India and said that he has not done anything wrong for which he should face the law. Watch the video for more.  Hindustan Times, owned by HT Media Ltd, is one of India’s largest publications that provides unbiased news, analysis and features on politics, sports, entertainment, lifestyle and more. Hindustan Times delivers the news across all social media platforms, on the web, and at your doorstep.",
        "article_link": "",
        "pub_date": "2023-03-25T17:43:11.420334700Z",
        "created_at": "2023-03-25T17:43:11.423498200Z"
    },
    {
        "article_id": 4,
        "rss_id": 2,
        "title": "Rajya Sabha Chairman teases Raghav Chadha over dating rumours with Parineeti Chopra | Watch",
        "summary": "Rajya Sabha Chairman Jagdeep Dhankar on Friday teased AAP MP Raghav Chadha over dating rumours with actor Parineeti Chopra in the Upper House. The remarks by the Rajya Sabha Chair left the Parliament in splits. Watch the video for more.  Hindustan Times, owned by HT Media Ltd, is one of India’s largest publications that provides unbiased news, analysis and features on politics, sports, entertainment, lifestyle and more. Hindustan Times delivers the news across all social media platforms, on the web, and at your doorstep.",
        "article_link": "",
        "pub_date": "2023-03-25T17:43:11.420334700Z",
        "created_at": "2023-03-25T17:43:11.424935300Z"
    }
]