[{"article_id":0,"rss_id":1,"title":"Delhi police to scrutinise footage of protest at India mission in UK","summary":"A senior Delhi Police officer said that they are reviewing photographs and video footage of the protest","created_at":"2023-03-27T17:24:42.650992700Z"},{"article_id":1,"rss_id":1,"title":"Soon, IMD forecasts to include ‘real feel’ factor","summary":"IMD will calculate HI or “real feel” using multiple models that will factor in the day’s relative humidity, wind speed, maximum temperature and cloud cover","created_at":"2023-03-27T17:24:42.652362300Z"},{"article_id":2,"rss_id":1,"title":"Restore roads before May 31: Chandrakant Patil to PMC","summary":"Pune district guardian minister Chandrakant Patil on Monday directed the Pune Municipal Corporation (PMC) to reinstate all city roads till May 31 before the beginning of the monsoon","created_at":"2023-03-27T17:24:42.654112400Z"},{"article_id":3,"rss_id":1,"title":"Pune sees drop in H3N2 cases as mercury surges","summary":"The rise in minimum and maximum temperature in the past few days has resulted in decline in cases of H3N2, a subtype of Influenza, in the city","created_at":"2023-03-27T17:24:42.668473800Z"},{"article_id":4,"rss_id":1,"title":"Licence renewal of meat shops violating norms put on hold by PMC","summary":"A majority of these shops are butchering animals inside their own premises without checking the health of the animals before killing them","created_at":"2023-03-27T17:24:42.670692400Z"},{"article_id":5,"rss_id":1,"title":"Delhi GP runs into controversy after player withdrawal","summary":"Zhansaya Abdumalik, a Grandmaster from Kazakhstan, pulled out of the tournament citing poor treatment from the organisers. ","created_at":"2023-03-27T17:24:42.672029300Z"},{"article_id":6,"rss_id":1,"title":"Four booked for land purchase by forging documents in Patiala","summary":"Police have booked four accused for allegedly selling and purchasing a residential plot of a Patiala resident by forging documents.","created_at":"2023-03-27T17:24:42.673267700Z"},{"article_id":7,"rss_id":1,"title":"Mamata Banerjee urges President Murmu to protect constitutional rights of people","summary":"Mamata Banerjee, who presented President Droupadi Murmu with a goddess Durga idol, played the tribal drum and danced with tribals during the programme.","created_at":"2023-03-27T17:24:42.674805700Z"},{"article_id":8,"rss_id":1,"title":"RS member urges Centre to start DigiClaim project in Punjab","summary":"Appreciating the pilot project of DigiClaim recently launched by Union minister Narendra Singh Tomar, Aam Aadmi Party (AAP) MP Vikramjit Sahney on Monday requested him to include Punjab in the project and start the DigiClaim operations in the state.","created_at":"2023-03-27T17:24:42.691458300Z"},{"article_id":9,"rss_id":1,"title":"Ops Akraman-V: Over 1,300 persons arrested as part of drive against criminals in Haryana","summary":"The Haryana Police, under a special drive to clean up the crime and criminal elements across the state, successfully conducted a series of coordinated raids and arrested 1,334 persons in the last 24 hours","created_at":"2023-03-27T17:24:42.692957100Z"},{"article_id":10,"rss_id":1,"title":"Arif’s gesture will be considered in violation of Wildlife Act case, say forest officials","summary":"Authorities have summoned Arif, who looked after the bird for a year, to explain his side at the office of the assistant conservator of forest in Gauriganj (Amethi) on April 2.","created_at":"2023-03-27T17:24:42.715691800Z"},{"article_id":11,"rss_id":1,"title":"Haryana Anti-Corruption Bureau arrests ASI for graft in Yamunanagar","summary":"The cop was identified as assistant sub-inspector (ASI) Kamal Rana, in-charge of the Kheri Lakha Singh police post under Radaur police station.","created_at":"2023-03-27T17:24:42.718548500Z"},{"article_id":12,"rss_id":1,"title":"Apple enforces 3-day office rule; defiance risks termination","summary":"Apple started requiring its remote employees to visit the workplace at least three times per week in September. Some of its employees criticised the strategy and demanded a more flexible work environment.","created_at":"2023-03-27T17:24:42.745885400Z"},{"article_id":13,"rss_id":1,"title":"Seeking job regularisation sanitation workers launch stir across Haryana","summary":"Due to the strike, garbage piled up at several places in Rohtak, Hisar, Bhiwani and other parts of the state","created_at":"2023-03-27T17:24:42.772181200Z"},{"article_id":14,"rss_id":1,"title":"Yogi welcomes SC decision on ULB polls, says govt committed to OBC reservation","summary":"Urban development minister AK Sharma said that the state government, as per the directions of the Supreme Court, will issue a notification on the OBC reservation in the next two days","created_at":"2023-03-27T17:24:42.799479100Z"},{"article_id":15,"rss_id":1,"title":"Elderly duped of  ₹7.8 lakh by cyber fraud posing as Indonesian woman","summary":"One of the members of the gang posed as an Indonesian woman to dupe the victim, resident of Indira Nagar.","created_at":"2023-03-27T17:24:42.826811400Z"},{"article_id":16,"rss_id":1,"title":"Inclement weather fall-out: Punjab to seek relaxation in wheat grain quality","summary":"The food and civil supplies department Punjab has decided to move a case before the Centre seeking relaxation in quality of wheat arriving in the state mandis for procurement.","created_at":"2023-03-27T17:24:42.854039200Z"},{"article_id":17,"rss_id":1,"title":"NFL owners push to allow private equity investments in clubs. What does it mean for the game?","summary":"A group of National Football League owners is pushing to allow private equity firms and institutional investors to buy stakes in clubs","created_at":"2023-03-27T17:24:42.893691Z"},{"article_id":18,"rss_id":1,"title":"2 prisoners flee from Arunachal Pradesh jail after killing constable","summary":"The two prisoners who escaped have been identified by the police as Rocksen Homchha, a cadre of the Nikki-Sumi faction of National Social Council of Nagaland (Khaplang), and the other as Titpu Kitnya, a murder accused.","created_at":"2023-03-27T17:24:42.922670600Z"},{"article_id":19,"rss_id":1,"title":"2016 Faridkot incident: 6 years on, four get 10-year RI for abetting Dalit family’s suicide","summary":"Six years after four members of a Dalit family ended their lives in Faridkot, a district court on Monday sentenced four accused to 10-year rigorous imprisonment  for abetment to suicide.","created_at":"2023-03-27T17:24:42.963808800Z"},{"article_id":20,"rss_id":1,"title":"Protest held against registration charge for admission in LU affiliated colleges","summary":"The LU authorities decided that candidates seeking admission to nearly 550 colleges affiliated to LU in five districts would need to register themselves on the LU admission portal after paying  ₹100.","created_at":"2023-03-27T17:24:42.999277900Z"},{"article_id":21,"rss_id":1,"title":"ICC changes Indore Test pitch’s ‘poor’ rating on appeal","summary":"The world body has changed it to “below average” which means instead of three demerit points, it will get only one. ","created_at":"2023-03-27T17:24:43.032383Z"},{"article_id":22,"rss_id":1,"title":"IPL 2023: Waiting to paint the town red","summary":"Fifteen years of not winning the IPL has tied RCB, DC and Punjab Kings in an insufferable knot","created_at":"2023-03-27T17:24:43.067652Z"},{"article_id":23,"rss_id":1,"title":"‘Depressed’ after separation from Arif, sarus consumes fish & corn after 40 hours","summary":"After being brought to the Kanpur zoo, the sarus was offered 2 kilos of live small fish but the bird refused to consume it.","created_at":"2023-03-27T17:24:43.102450400Z"},{"article_id":24,"rss_id":1,"title":"Naveen Patnaik asks Centre to lift 20 lakh tonne of surplus rice","summary":"Odisha chief minister Naveen Patnaik said about 65 lakh metric tonne of paddy has been procured for Kharif Marketing Season 2022-23 in Odisha till March 22","created_at":"2023-03-27T17:24:43.122264800Z"},{"article_id":25,"rss_id":1,"title":"Spice of Life: Trust, easiest to lose, hardest to regain","summary":"Trust creates hope, something which has to be earned and it can often take time; it remains the most essential foundation of any relationship.","created_at":"2023-03-27T17:24:43.142833100Z"},{"article_id":26,"rss_id":1,"title":"Lucknow start-up to teach women about finance in rural U.P.","summary":"FinLit was started by Neha in 2020 after realising that she too was quite unaware of how to manage and invest her finances when she was young.","created_at":"2023-03-27T17:24:43.163393500Z"},{"article_id":27,"rss_id":1,"title":"Crematoriums overcharging people for wood, say corporators","summary":"Following the letter from BJP corporators Rekha Roshni and Ranjit Singh, a committee has been formed by the municipal commissioner to look into the issue.","created_at":"2023-03-27T17:24:43.179933400Z"},{"article_id":28,"rss_id":1,"title":"BPSC declares 68th CCE prelims result","summary":"Candidates who have cleared the preliminary test are eligible to appear for the BPSC main exam and interview.","created_at":"2023-03-27T17:24:43.197369500Z"},{"article_id":29,"rss_id":1,"title":"Bihar: Cong raises Rahul issue, JD-U joins protest; BJP agitates over power tariff hike","summary":"As soon as the proceedings of the Assembly got underway, BJP and the Congress legislators reached the well shouting slogans.","created_at":"2023-03-27T17:24:43.215830400Z"},{"article_id":30,"rss_id":1,"title":"Patna: Maurya hotel owner booked after liquor bottles found during ED search","summary":"Following the seizure, the excise department also searched SP Sinha’s hotel and his chartered accountant’s premises but no further recovery was made, officials said.","created_at":"2023-03-27T17:24:43.231569800Z"},{"article_id":31,"rss_id":1,"title":"Ukraine Army's Bakhmut 'escape route' closing? Putin's flamethrower fury caught on cam","summary":"Horror as thermobaric missile launcher vaporised Ukrainian positions in Bakhmut region. Russia unleashed brutal bombardment using the feared TOS-1A thermobaric missile launcher. Far more dangerous than conventional explosives, thermobaric weapons can vaporise bodies. Watch this video for more. ","created_at":"2023-03-27T17:24:43.246374Z"},{"article_id":32,"rss_id":1,"title":"Putin to make U.S.-led West pay for Nord Stream blasts? May seek compensation","summary":"Nearly six months after the mysterious explosions, Moscow may ask the west to pay up for damages on the Nord Stream pipelines. Citing a Russian diplomat, RIA Novosti reported that Russia may seek compensation over damage from last year's explosions on the Nord Stream pipelines. In September 2023, the pipelines that supplied gas from Russia to Germany under the Baltic Sea were hit by mysterious explosions. Russia has been pushing for an independent international probe at the UNSC, but its demands have been rejected by the West. Months later, the blame game between Moscow and the West over sabotage is still on. Watch this video for details. ","created_at":"2023-03-27T17:24:43.260690900Z"},{"article_id":33,"rss_id":1,"title":"Top 7 strongest characters in Jujutsu Kaisen anime: Who are they?","summary":"Here are the top 7 strongest characters in Jujutsu Kaisen anime so far.","created_at":"2023-03-27T17:24:43.278295500Z"},{"article_id":34,"rss_id":1,"title":"Opposition parties to keep on with ‘black’ protest against Centre with 'same energy'","summary":"Opposition parties decided to continue its protest over Rahul Gandhi's disqualification and demand for JPC probe in the Adani-Hindenburg issue.","created_at":"2023-03-27T17:24:43.298743500Z"},{"article_id":35,"rss_id":1,"title":"BSP to go solo in K’taka assembly polls","summary":"The Bahujan Samaj Party (BSP) will contest the upcoming assembly elections in Karnataka on its own","created_at":"2023-03-27T17:24:43.323940800Z"},{"article_id":36,"rss_id":1,"title":"India forward Manvir Singh injured, may miss Kyrgyz Republic game","summary":"A draw away from title, India likely to make six changes against higher-ranked opponents in tri-nation football tournament being played in Imphal","created_at":"2023-03-27T17:24:43.346363600Z"},{"article_id":37,"rss_id":1,"title":"Cricketer Kedar Jadhav’s father Mahadev goes missing in Pune","summary":"Cricketer Kedar Jadhav's father Mahadev Sopan Jadhav has gone missing since Monday morning from Pune's Kothrud area. ","created_at":"2023-03-27T17:24:43.369629700Z"},{"article_id":38,"rss_id":1,"title":"Test Covid preparations in all hospitals via mock drills: U.P. CM","summary":"Guidelines were given in the meeting regarding health infrastructure and logistic preparations, the status of the vaccination campaign, prevention of infection of new variants of Covid","created_at":"2023-03-27T17:24:43.401752700Z"},{"article_id":39,"rss_id":1,"title":"Three children killed in shooting at Tennessee school in US; suspect dead","summary":"\"We are responding to an active aggressor at 33 Burton Hills Blvd Covenant School. We can confirm we have multiple patients. Parents coming to the school should go to 20 Burton Hills at this time. This is an active scene,\" the Nashville fire department said","created_at":"2023-03-27T17:24:43.442008800Z"},{"article_id":40,"rss_id":1,"title":"2 injured after fight sparks shooting at US gurdwara","summary":"Two people were shot at in a gurdwara in the US state of California, with authorities ruling out the incident as a hate crime.","created_at":"2023-03-27T17:24:43.477187200Z"},{"article_id":41,"rss_id":1,"title":"In Jalandhar: Bhawant Mann gives go ahead to projects worth  ₹100-cr","summary":"Punjab chief minister Bhagwant Mann on Monday gave a go ahead to development projects worth nearly  ₹100 crore.","created_at":"2023-03-27T17:24:43.512366100Z"},{"article_id":42,"rss_id":1,"title":"Is Nitin Gadkari hinting at retirement from politics?","summary":"His remarks are being seen as an indication that the Nagpur strongman with close ties to Rashtriya Swayamsevak Sangh is considering retirement from active politics, especially after his relations with the BJP top brass strained of late","created_at":"2023-03-27T17:24:43.542783900Z"},{"article_id":43,"rss_id":1,"title":"Manmeet Colon 1st Sikh woman to take charge as Connecticut’s asst police chief","summary":"Lt. Manmeet Colon, a 37-year-old Indian-origin Sikh woman officer, has assumed charge as the assistant police chief in the US state of Connecticut, becoming the department’s first-ever second-in-command of Asian descent.","created_at":"2023-03-27T17:24:43.577301800Z"},{"article_id":44,"rss_id":1,"title":"Zelensky's new headache; China's TikTok app is stalling Ukraine's weapons supply | Report","summary":"War-battered Ukraine's ammunition supply is being threatened by Chinese owned app TikTok. According to Financial times, one of Europe's largest ammunition makers said that it is unable to meet Ukraine's demand because of a nearby TikTok data centre. Remember, TikTok has come under increased scrutiny in U.S. for its ties with China. Watch this video to find out more. ","created_at":"2023-03-27T17:24:43.607640900Z"},{"article_id":45,"rss_id":1,"title":"U.P.: Teacher aspirants protest outside minister’s residence in Lucknow","summary":"Uttar Pradesh basic education minister Sandeep Singh seeks 20-day time, assures them to take a decision in their favour","created_at":"2023-03-27T17:24:43.637097Z"},{"article_id":46,"rss_id":1,"title":"Two women arrested for harbouring Amritpal, aide sent to judicial custody","summary":"Jalandhar A Nakodar court on Monday sent two women, accused of providing shelter to fugitive pro-Khalistan leader Amritpal Singh and his aide Papalpreet, to judicial custody","created_at":"2023-03-27T17:24:43.657736700Z"},{"article_id":47,"rss_id":1,"title":"Pak cops in plain clothes ‘attack’ Imran Khan’s party men outside Islamabad HC","summary":"The Islamabad High Court has granted interim bail to former PM Imran Khan in seven different cases registered against him following clashes. Imran Khan arrived in the court complex shielded by bulletproof vests. Meanwhile, high drama erupted outside with police, allegedly in plain clothes, 'attacking' Imran Khan's party members and supporters. Watch this video for more details. ","created_at":"2023-03-27T17:24:43.684824Z"},{"article_id":48,"rss_id":1,"title":"U.P. CM to gift projects worth  ₹6K crore to Gorakhpur, Kushinagar","summary":"Uttar Pradesh chief minister Yogi Adityanath will gift projects worth  ₹6,000 crore to Gorakhpur and Kushinagar districts during his three-day visit to Gorakhpur starting Tuesday (March 28), said the CM’s camp office here on Monday","created_at":"2023-03-27T17:24:43.708692800Z"},{"article_id":49,"rss_id":1,"title":"Allow radical leader’s aide to contact kin: Plea in HC","summary":"Surinderpal Singh Aujla, the brother of social media handler of pro-Khalistan leader Amritpal Singh, on Friday moved the Punjab and Haryana high court demanding that NRI Gurinder Pal alias Gur Aujla be allowed to contact his family members.","created_at":"2023-03-27T17:24:43.738438800Z"},{"article_id":50,"rss_id":1,"title":"Khalistan supporters protest at Times Square in New York","summary":"Khalistan supporters staged a protest at the iconic Times Square here to express support for the fugitive radical preacher Amritpal Singh on Sunday.","created_at":"2023-03-27T17:24:43.769095600Z"},{"article_id":51,"rss_id":1,"title":"5 pocket perfumes to smell fragrant all day long","summary":"Pocket perfumes are compact in size and come in handy to a great deal. ","created_at":"2023-03-27T17:24:43.787501200Z"},{"article_id":52,"rss_id":1,"title":"23 fall ill after taking khichdi at community feast in U.P.’s Baghpat","summary":"At least 23 people, including some children, fell ill after having khichdi at a religious community feast organised at Faizpur Ninana village in Baghpat district on Sunday night, police said on Monday","created_at":"2023-03-27T17:24:43.806308500Z"},{"article_id":53,"rss_id":1,"title":"Amritpal believed to be hiding in Nepal: Report","summary":"India has requested the Nepal government not to allow fugitive radical preacher Amritpal Singh, who is believed to be hiding in Nepal, to flee to a third country and arrest him if he attempts to escape using Indian passport or any other fake passport, a media report said on Monday.","created_at":"2023-03-27T17:24:43.826826900Z"},{"article_id":54,"rss_id":1,"title":"NATO Nation, friends with Russia, rips Biden and West | 'Don't Impose Anything On Us'","summary":"In a scathing criticism of the West, Hungary’s foreign minister said that its 'steady criticism' of Hungary on democratic and cultural issues makes the small European country’s right-wing govt reluctant to offer support on practical matters. In an interview with The Associated Press, Hungarian Foreign Minister Péter Szijjártó extensively talked about NATO's expansion plans and also said that his country has not voted on whether to allow Finland and Sweden to join the alliance as Budapest is 'sick' of their constant critiques. Watch this video to find out more. ","created_at":"2023-03-27T17:24:43.850845200Z"},{"article_id":55,"rss_id":1,"title":"Hogwarts Legacy play-styles evolve as players experiment spells and stealth","summary":"Players are eager to explore the world of Harry Potter in a way never before possible with different sneaky and savage playstyles","created_at":"2023-03-27T17:24:43.869761800Z"},{"article_id":56,"rss_id":1,"title":"Have directed DGP to release youth taken in preventive custody: Bhagwant Mann","summary":"Punjab chief minister Bhagwant Mann said the state government and Punjab Police are working as per law of land in the crackdown against Amritpal Singh, chief of Waris Punjab De.","created_at":"2023-03-27T17:24:43.886592100Z"},{"article_id":57,"rss_id":1,"title":"4-lane bridge on Versova creek in Mumbai opens to public","summary":"The four-lane bridge, built at a cost of over  ₹247 crore, would provide a significant relief from traffic jams across the Versova creek on the Mumbai-Surat corridor.","created_at":"2023-03-27T17:24:43.902939900Z"},{"article_id":58,"rss_id":1,"title":"Sreeja Akula clinches 2nd successive singles crown at National Table Tennis C'ships, G Sathiyan wins men's singles","summary":"Sreeja Akula succesfully defended her singles title with a win against Sutirtha Mukherjee in the final, at the Senior National Table Tennis Championships.","created_at":"2023-03-27T17:24:43.920164300Z"},{"article_id":59,"rss_id":1,"title":"Amritpal’s one more aide held under NSA; sent to Assam’s Dibrugarh jail","summary":"Punjab Police have arrested one more close associate of Waris Punjab De head Amritpal Singh, who has allegedly been absconding, under the stringent national security act .","created_at":"2023-03-27T17:24:43.935684Z"},{"article_id":60,"rss_id":1,"title":"Israeli PM Netanyahu to delay judicial overhaul for next parliament session","summary":"Israel protests: The judicial overhaul has been pushed to the next session of the parliament in order to “pass the reform through dialogue”, the statement said.","created_at":"2023-03-27T17:24:43.953061600Z"},{"article_id":61,"rss_id":1,"title":"Jonty Rhodes backs Lucknow Super Giants skipper KL Rahul to shine in IPL 2023","summary":"The India batter led 2022 IPL debutants Lucknow Super Giants into the playoffs but has faced scrutiny over his poor run of scores for India coming into the T20 league starting on Friday","created_at":"2023-03-27T17:24:43.976654300Z"},{"article_id":62,"rss_id":1,"title":"Over 1.55 lakh posts vacant in three forces, maximum in Army, says govt","summary":"According to the government, there are around 1.55 lakh unfilled positions across three forces, with the majority in the Army.","created_at":"2023-03-27T17:24:43.999359300Z"},{"article_id":63,"rss_id":1,"title":"Daily brief: Pro-Khalistan outfit's threat calls before G20 meet in Uttarakhand, and all the latest news","summary":"Here are today’s top news, analysis, and opinion. Know all about the latest news and other news updates from Hindustan Times. ","created_at":"2023-03-27T17:24:44.026782900Z"},{"article_id":64,"rss_id":1,"title":"The balance of free speech and State interests","summary":"SC’s revival of guilty-by-association doctrine further narrows the bail window under UAPA","created_at":"2023-03-27T17:24:44.051327700Z"},{"article_id":65,"rss_id":1,"title":"MNS protest exposes TMC’s apathy towards nullah clean up","summary":"The nullah is in such bad state that one cannot walk nearby it. Every year it is the same story. There is no action taken by the civic body even as it claims to keep the city clean by spending crores of rupees. Most of the nullahs in Thane city are unclean and full of plastic waste","created_at":"2023-03-27T17:24:44.074198500Z"},{"article_id":66,"rss_id":1,"title":"A strategy to improve tiger viability in India","summary":"The biggest success of Project Tiger, which marks 50 years, is the presence of tigers in all habitat types. But serious issues persist, including the urgent need for new approaches beyond the protected areas. Address these so that India can host 10,000 tigers one day","created_at":"2023-03-27T17:24:44.098102200Z"},{"article_id":67,"rss_id":1,"title":"Red Dead Redemption 2's photo mode reveals ridiculously gruesome detail, leaving fans hungry for more in GTA 6","summary":"The level of detail in this game is truly impressive, and fans are hoping that Rockstar will include this feature in their upcoming game, GTA 6","created_at":"2023-03-27T17:24:44.120163300Z"},{"article_id":68,"rss_id":1,"title":"Challenge from Savarkar's grandson to ‘childish’ Rahul Gandhi: 'Show me...'","summary":"VD Savarkar's grandson Ranjit Savarkar described Rahul Gandhi's “I am not Savarkar” comments as \"childish\" and challenged him to furnish proof of Savarkar apologising to British authorities.","created_at":"2023-03-27T17:24:44.140746400Z"},{"article_id":69,"rss_id":1,"title":"India must claim damages for attacks on embassies","summary":"The failure to provide protection to Indian missions does not automatically mean that New Delhi ought to be compensated for the damages to the property or for the injuries to its employees. It is, however, open to India to make claims with respective countries for existing and future incidents","created_at":"2023-03-27T17:24:44.164922200Z"},{"article_id":70,"rss_id":1,"title":"‘Amritpal Singh may try to flee via Nepal’: India sends alert to Kathmandu","summary":"The Indian embassy asked the Nepal government “not to permit Amritpal Singh to travel through Nepal for any third country”","created_at":"2023-03-27T17:24:44.187234200Z"},{"article_id":71,"rss_id":1,"title":"Address systemic issues in the armed forces archives","summary":"The military must understand the value of sharing information and open up to scholarly scrutiny. Such self-knowledge is necessary to intellectually prepare future leaders for emerging challenges","created_at":"2023-03-27T17:24:44.205929900Z"},{"article_id":72,"rss_id":1,"title":"Pak’s ‘in principle’ decision to attend SCO meets in India, undecided on mode","summary":"Pakistan’s participation in the SCO national security advisers meeting on March 29 is most likely to be virtual. Last week, the government told the Lok Sabha that the foreign ministers of China and Pakistan are yet to confirm their participation in the meeting scheduled for May 4-5","created_at":"2023-03-27T17:24:44.258835300Z"},{"article_id":73,"rss_id":1,"title":"Israeli diplomats strike against Netanyahu's overhaul plan: Trade Union","summary":"Workers from across a range of fields went on strike Monday, in a bid to ramp up pressure on Prime Minister Benjamin Netanyahu to scrap the overhaul plan.","created_at":"2023-03-27T17:24:44.291694400Z"},{"article_id":74,"rss_id":1,"title":"Rani Mukerji says the word ‘content’ bothers her a lot, movies should be watched in theatres","summary":"Rani Mukerji talked about cynicism that was around Mrs Chatterjee Vs Norway release. The film released on March 17.","created_at":"2023-03-27T17:24:44.323827300Z"},{"article_id":75,"rss_id":1,"title":"Sri Lanka to seek $1 billion aid from India for essentials: Report","summary":"Sri Lanka crisis: The Sri Lankan finance ministry officials held talks with its Indian counterparts to obtain the new temporary USD 1 billion facility for the purchase of essential items.","created_at":"2023-03-27T17:24:44.360962Z"},{"article_id":76,"rss_id":1,"title":"Headmaster Phineas Black brings his family's bigotry to Hogwarts Legacy. Will players fight back?","summary":"While Black's views are not surprising given his family history, they do shed new light on the character and his motivations","created_at":"2023-03-27T17:24:44.391177400Z"},{"article_id":77,"rss_id":1,"title":"Gujarat: 16 Congress MLAs suspended after protests over Rahul’s disqualification","summary":"The MLAs have been suspended from the legislative assembly till the remainder of the budget session that is underway till March 29","created_at":"2023-03-27T17:24:44.421073600Z"},{"article_id":78,"rss_id":1,"title":"TSSPDCL recruitment: March 28 last date to apply for 1553 Junior Lineman posts","summary":"TSSPDCL will end the application process for Junior Lineman posts tomorrow, March 28.","created_at":"2023-03-27T17:24:44.451048200Z"},{"article_id":79,"rss_id":1,"title":"Delhi CM Arvind Kejriwal calls BJP government 'uneducated', takes jibe at Centre","summary":"Delhi CM was discussing about the development work done by his government in Delhi when he mocked the BJP.","created_at":"2023-03-27T17:24:44.481895300Z"},{"article_id":80,"rss_id":1,"title":"TMC readies isolation ward, increases testing","summary":"The TMC recorded 33 new positive Covid cases on Monday, while on Sunday 51 cases were reported. The active Covid patients in the city now total 246. The count of positive cases recorded till last month was below five cases, which has now crossed 50 plus cases, claimed civic health officials","created_at":"2023-03-27T17:24:44.510922800Z"},{"article_id":81,"rss_id":1,"title":"An ode to Odia cuisine","summary":"Ahead of Odisha Foundation Day on April 1, we dig into some traditional Odia delicacies and their fusion counterparts.","created_at":"2023-03-27T17:24:44.540624Z"},{"article_id":82,"rss_id":1,"title":"'Amritpal Singh In Nepal': India tells Nepalese Govt to stop Khalistan preacher's escape","summary":"India has requested Nepal to prevent Khalistani preacher and Waris Punjab De chief Amritpal Singh from fleeing the country using Indian or some other fake passport,a report in The Kathmandu Post has said. This as a new picture of fugitive Khalistani radical emerged online. Amritpal is on the run since over last one week and a massive manhunt is underway in multiple states to arrest him. Watch the video for more details.","created_at":"2023-03-27T17:24:44.573954Z"},{"article_id":83,"rss_id":1,"title":"Watch: Deepak Chahar gets Chepauk roaring a day after losing BCCI contract","summary":"Be it Chinnaswamy, Chepauk, or Sawai Mansingh, fans have already started thronging the venue to watch their favourite stars prepare for cricket's biggest festival.","created_at":"2023-03-27T17:24:44.612360400Z"},{"article_id":84,"rss_id":1,"title":"Baby boom in Hollywood: From Lindsay Lohan, Kaley Cuoco to Rihanna, check out celebs that are ready to embrace parenthood","summary":"From Rihanna’s second pregnancy to Lindsay Lohan’s first baby, many celebrities from the world of Hollywood are expecting babies in 2023","created_at":"2023-03-27T17:24:44.640273300Z"},{"article_id":85,"rss_id":1,"title":"Russia won't change nuke plans in Belarus, says Kremlin","summary":"Russia-Ukraine war: The West condemned Putin's weekend announcement on placing the weapons in EU and NATO-bordering Belarus.","created_at":"2023-03-27T17:24:44.668789700Z"},{"article_id":86,"rss_id":1,"title":"Siddharth Vishwakarma among six Indians to qualify for main draw of ITF Mysuru Open 2023","summary":"The top seed of the qualifiers Siddharth Vishwakarma put up a dominating display to secure a 6-1, 6-2 victory against Deepak Anantharamu.","created_at":"2023-03-27T17:24:44.696838700Z"},{"article_id":87,"rss_id":1,"title":"Cardi B, Post Malone, Gwyneth Paltrow and more: Hollywood celebs and their legal woes","summary":"From Gwyneth Paltrow to Bad Bunny, many celebrities from Hollywood are busy with legal woes, some clearing it up, and some settling it","created_at":"2023-03-27T17:24:44.725135500Z"},{"article_id":88,"rss_id":1,"title":"Taliban intercept suicide bomber in Kabul. Watch how he exploded himself","summary":"At least six people were killed in a suicide attack in Kabul. The blast occurred at a security checkpoint near Afghanistan's foreign ministry. The security officials identified the suicide attacker but his explosives detonated, causing a blast. Three Taliban security officials were among the dozens injured. The blast was a second attack near the Foreign Ministry in less than three months, and the first since Ramadan began. Watch this video for details. ","created_at":"2023-03-27T17:24:44.779360900Z"},{"article_id":89,"rss_id":1,"title":"Hutong Cat | Xi Jinping and Vladimir Putin: Friends with strategic benefits","summary":"Over the years, Xi and Putin seem to have developed a strong personal relationship seemingly enabling them to overcome some of the historical mistrust that has plagued Sino-Russia relations. This was evident in Xi's recent visit","created_at":"2023-03-27T17:24:44.816040100Z"},{"article_id":90,"rss_id":1,"title":"IPS officer swims from Gateway of India to Elephanta Caves, becomes first person ever to do so","summary":"IPS Krishna Prakash completed the expedition in just 5 hours and 26 minutes. ","created_at":"2023-03-27T17:24:44.854241600Z"},{"article_id":91,"rss_id":1,"title":"India is setting standards on the issue of gender justice: Smriti Irani","summary":"She highlighted the achievements of the PM Narednra Modi-led government in transitioning from women’s development to “women-led development”","created_at":"2023-03-27T17:24:44.897951500Z"},{"article_id":92,"rss_id":1,"title":"6 killed in suicide blast in Kabul, second in 3 months","summary":"Kabul suicide attack: Monday's blast was the second attack near the foreign ministry in Kabul in less than three months, and the first since the Muslim holy month of Ramadan began on Thursday in Afghanistan.","created_at":"2023-03-27T17:24:44.966328300Z"},{"article_id":93,"rss_id":1,"title":"'I think the team...': Former RCB player AB de Villiers gives big update on IPL comeback","summary":"Speaking during the RCB Unbox event, AB de Villiers gave a big update on his IPL comeback. De Villiers began his IPL career with Delhi Daredevils from 2008 to 2010, and then joined RCB from IPL 2011 onwards, going on to play with them until 2021.","created_at":"2023-03-27T17:24:44.996285700Z"},{"article_id":94,"rss_id":1,"title":"Pro-Khalistan protests at Golden Temple as hardliners back Amritpal Singh","summary":"10 days on, the hunt for Khalistan separatist leader Amritpal Singh continues. While cops are on a massive hunt, support for the secessionist leader refuses to die down. In the latest instance, pro-Amritpal Singh protests were held at the Golden Temple in Amritsar. The protesters were seen standing in front of Akal Takht inside the Golden Temple Complex. Separatist leader Amritpal Singh has been on the run since March 18. Singh is believed to have left Punjab and is said to be hiding in Nepal. India has requested that the Nepal government not allow fugitive radical preacher Amritpal Singh to flee to a third country. ","created_at":"2023-03-27T17:24:45.024895Z"},{"article_id":95,"rss_id":1,"title":"Amritpal Singh's new picture surfaces — maroon turban, sunglasses and a can","summary":"A new picture of Amritpal Singh with his key aide Papalpreet Singh surfaced on Monday on social media even as the hunt for the pro-Khalistani leader entered Day 10.","created_at":"2023-03-27T17:24:45.047016300Z"},{"article_id":96,"rss_id":1,"title":"Malcolm Brodgon  predicts All-NBA for Jaylen, Celtics' future hangs in balance","summary":"After watching Jaylen Brown burn down the inside of Spur's defense Sunday night, Malcolm Brogdon delivered a proclamation that could shape the Celtics’ future","created_at":"2023-03-27T17:24:45.070365700Z"},{"article_id":97,"rss_id":1,"title":"'God forbid if Virat chases this down, they'll vandalise my house': Ex-Pakistan captain after dropping Kohli cheaply","summary":"Virat Kohli is called the Master of Chase but there have been instances when Kohli has faltered while chasing.","created_at":"2023-03-27T17:24:45.100052600Z"},{"article_id":98,"rss_id":1,"title":"Deepti Naval meets old relative she'd been searching for in 'obscure' Punjab village","summary":"Deepti Naval shares a picture with an old relative whom she found in a Punjab village, after searching for her for years.","created_at":"2023-03-27T17:24:45.132627700Z"},{"article_id":99,"rss_id":1,"title":"SC issues notice on bail to Karnataka MLA in alleged KSDL bribery case","summary":"The bench issued notice to Madal Virupakshappa seeking response on the plea by the Lokayukta police challenging the order granting anticipatory bail to the Channagiri MLA on March 7","created_at":"2023-03-27T17:24:45.158074500Z"},{"article_id":100,"rss_id":1,"title":"Best Samsung smartphones with 5G compatibility: Buying guide","summary":"This article discusses the top 4 budget Samsung smartphones with 5G compatibility that are available in India.","created_at":"2023-03-27T17:24:45.183995200Z"},{"article_id":101,"rss_id":1,"title":"Struggling with yellow teeth? Here are 5 reasons why you should try teeth whitening ","summary":"Ready to flash a bright and confident smile? Look no further than teeth whitening! Here are five reasons why this simple cosmetic treatment could be just what you need to take your smile to the next level.","created_at":"2023-03-27T17:24:45.213517300Z"},{"article_id":102,"rss_id":1,"title":"Russian missiles hit Slovyansk, Avdiivka | Zaporizhzhia shelled 14 times","summary":"Ukraine Army has claimed that Russia launched two missile strikes, 23 airstrikes and 38 attacks from MLRS in the past day. It added that Slovyansk and Avdiivka in Donetsk and Zaporizhzhia bore the brunt of the attacks. According to Ukraine's President Volodymyr Zelensky, two people were killed in 'terrorist attack' by Russia. Zaporizhzhia on the other hand, was shelled 14 times in the last 24 hours. A top Ukrainian official has expressed fears that Russia wants to turn Avdiivka into a scene from a post-apocalyptic movies. Watch this video for more updates from the Russia-Ukraine conflict. ","created_at":"2023-03-27T17:24:45.235656500Z"},{"article_id":103,"rss_id":1,"title":"Kim K, Kylie Jenner, Courtney Cox: Hollywood celebs opt for removing botox, fillers and implants","summary":"Many Hollywood celebrities have often admitted that they have succumbed to the temptation to go under the knife, and sometimes, their changing appearances give away the Botox factor","created_at":"2023-03-27T17:24:45.264651900Z"},{"article_id":104,"rss_id":1,"title":"Didn’t follow security protocol: Panel on BJP MLA’s death in Chhattisgarh attack","summary":"Bhima Mandavi, three policemen and a driver were killed on April 9, 2019, when their vehicle was blown up in Chhattisgarh’s Bastar","created_at":"2023-03-27T17:24:45.286525400Z"},{"article_id":105,"rss_id":1,"title":"Ultimate Table Tennis is back, Season 4 to kick off July 13 in Pune","summary":"The Ultimate Table Tennis league was last played out in Delhi in 2019 where Chennai Lions, spearheaded by Indian table tennis legend Sharath Kamal won the third edition by beating Sathiyan’s Dabang Delhi TTC in the final.","created_at":"2023-03-27T17:24:45.365969100Z"},{"article_id":106,"rss_id":1,"title":"Ram Charan sits on wife Upasana Konidela's lap in adorable birthday pic, she calls him 'bestie'","summary":"Ram Charan's wife Upasana Konidela posted pictures with the actor on his birthday. He turned 38.","created_at":"2023-03-27T17:24:45.408486200Z"},{"article_id":107,"rss_id":1,"title":"Rony Talukdar slams maiden half-century as Bangladesh beat Ireland in rain-shortened T20I opener","summary":"Rony Talukdar hit his maiden half-century to help Bangladesh secure a 22-run win against Ireland by DLS method on Monday in the opener of a three-match Twenty20 international series.","created_at":"2023-03-27T17:24:45.455219700Z"},{"article_id":108,"rss_id":1,"title":"Review: Trust by Hernan Diaz","summary":"Revisiting a novel that might have missed winning the 2022 Booker Prize but is sure to continue to say more each time you read it","created_at":"2023-03-27T17:24:45.495926600Z"},{"article_id":109,"rss_id":1,"title":"Neha Dhupia thanks Pradeep Sarkar for giving her the first chance: I am here because of dada","summary":"Actor Neha Dhupia mourns losing filmmaker Pradeep Sarkar, saying his legacy will continue to live on through his projects","created_at":"2023-03-27T17:24:45.546701700Z"},{"article_id":110,"rss_id":1,"title":"Madal Virupakshappa, BJP Karnataka MLA, arrested in bribery case","summary":"BJP MLA Madal Virupakshappa was arrested on Monday, hours after the Karnataka high court dismissed his bail application in a bribery case relating to Karnataka Soaps and Detergents Limited.","created_at":"2023-03-27T17:24:45.617072700Z"},{"article_id":111,"rss_id":1,"title":"Gajraj Rao remembers Pradeep Sarkar: Dada was a student by heart willing to learn new things even at the age of 40","summary":"Acror Gajraj Rao remembers late filmmaker Pradeep Sarkar as a forever student, a humble human and determined filmmaker and a pillar for many.","created_at":"2023-03-27T17:24:45.654910800Z"},{"article_id":112,"rss_id":1,"title":"Female cheetah from Namibia dies in MP’s Kuno Park due to renal infection","summary":"Sasha died at around 8am on Monday and at this point, renal failure is suspected, as an official said cheetahs are prone to renal disease","created_at":"2023-03-27T17:24:45.689224600Z"},{"article_id":113,"rss_id":1,"title":"Bulls ruin LeBron's return while Cavaliers clinch playoff spot without him first time in 23 Years","summary":"LeBron James scored 19 points off the bench in his return from a month-long injury absence, but Zach LaVine had 32 to lead the Chicago Bulls to a 118-108 victory","created_at":"2023-03-27T17:24:45.724558400Z"},{"article_id":114,"rss_id":1,"title":"Top 5 Sony OLED TVs to buy in 2023","summary":"Do you love OLED TVs but need some description about them? You have come to the right place! You can enjoy watching high-definition movies.","created_at":"2023-03-27T17:24:45.759168300Z"},{"article_id":115,"rss_id":1,"title":"Actors on using filters and photo-editing apps on social media: How much is too much!","summary":"With easy access to photo-editing tools, ‘perfection’ seems just a click away. But at what cost? Some popular faces from showbiz give their two cents.","created_at":"2023-03-27T17:24:45.800373300Z"},{"article_id":116,"rss_id":1,"title":"Helang-Marwari bypass project stuck in a limbo awaits IIT report","summary":"The concerned authorities are still waiting for the report of the IIT Roorkee to decide if the re-beginning of work would aggravate the land crisis problem.","created_at":"2023-03-27T17:24:45.843415500Z"},{"article_id":117,"rss_id":1,"title":"Ravi Kishan was asked to be a ‘gigolo’, says 'many such offers came my way'","summary":"Ravi Kishan was asked about the time he was offered the job of a gigolo and the actor said that he refused to fall in those traps and managed to stay focussed.","created_at":"2023-03-27T17:24:45.896008800Z"},{"article_id":118,"rss_id":1,"title":"Suniel Shetty is upset with Govinda and the reason is actually quite wholesome","summary":"Suniel Shetty wishes Govinda would act in more films, considering how popular he used to be with fans earlier.","created_at":"2023-03-27T17:24:45.967857900Z"},{"article_id":119,"rss_id":1,"title":"Sunny Hinduja: People should not play safe and create content they believe in","summary":"Sunny Hinduja is known as Sandeep bhaiya from the world of Aspirants, and Milind from The Family Man, and was most recently seen as an antagonist in Shehzada","created_at":"2023-03-27T17:24:45.994245700Z"},{"article_id":120,"rss_id":1,"title":"Dia Mirza on her character in Anubhav Sinha’s Bheed: I was sobbing while reading the script based on migrant crisis","summary":"Actor Dia Mirza shares the experience of working on a project like Bheed, why it’s important for films like these to be made and more.","created_at":"2023-03-27T17:24:46.013274500Z"},{"article_id":121,"rss_id":1,"title":"Top 10 spy cameras for home: Buyer's guide","summary":"This article discusses the top 10 spy cameras. Read on to find the perfect spy camera to keep your home safe and secure.","created_at":"2023-03-27T17:24:46.032092200Z"},{"article_id":122,"rss_id":1,"title":"Amar Upadhyay: TV gives me grounds to experiment, but there is a certain limit to it","summary":"TV actor Amar Upadhyay is grateful to small screen for making him a household name but he isn’t okay about becoming too comfortable with any medium.","created_at":"2023-03-27T17:24:46.049238500Z"},{"article_id":123,"rss_id":1,"title":"Rapper Divine calls choosing the path of music his “boldest decision” so far","summary":"Indian rapper Divine wants the next generation to imbibe and pursue a life led by bold thinking and actions","created_at":"2023-03-27T17:24:46.065252700Z"},{"article_id":124,"rss_id":1,"title":"On Cam: Taliban's artillery fire marks Pak’s historic T20i defeat to Afghanistan","summary":"Pakistan faced a defeat at the hands of Afghanistan in the second Twenty20 international on Mar 26. It was the first time that Afghanistan won a series against a top-six ranked ICC team. Afghanistan's victory was celebrated in Kabul with Taliban fighters opening artillery fire in the air. Watch this video for more details. ","created_at":"2023-03-27T17:24:46.081950500Z"},{"article_id":125,"rss_id":1,"title":"Portals of Yamunotri Dham to open on April 22","summary":"Temple committee secretary Suresh Uniyal announced the time of the opening of portals in the presence of other temple committee officials and priests.","created_at":"2023-03-27T17:24:46.098294600Z"},{"article_id":126,"rss_id":1,"title":"Rahul Gandhi sent notice to vacate Tughlaq Lane bungalow in 30 days","summary":"Rahul Gandhi, who had been a lawmaker for 19 years, was disqualified from the Lok Sabha on Friday, a day after a Surat court convicted him in a criminal defamation case for a remark he made ahead of the 2019 general elections","created_at":"2023-03-27T17:24:46.121271700Z"},{"article_id":127,"rss_id":1,"title":"Shabana Azmi: My broken wrist puts on some challenges, but I am happiest when I’m working","summary":"Actor Shabana Azmi talks about her broken wrist, and her international project, What’s Love Got to Do with It?, helmed by Shekhar Kapur","created_at":"2023-03-27T17:24:46.148559600Z"},{"article_id":128,"rss_id":1,"title":"Warriors suffer shock loss to Timberwolves, leaving playoff hopes in jeopardy","summary":"Kyle Anderson intercepted a Draymond Green pass and Karl-Anthony Towns turned it into a 3-pointer with 11.1 seconds remaining, calling the game for Timberwolves","created_at":"2023-03-27T17:24:46.173613500Z"},{"article_id":129,"rss_id":1,"title":"Italian pianist-vocalist Matteo Bocelli expresses desire to collaborate with more Indian artistes","summary":"Italian pianist and vocalist Matteo Bocelli talks about his love for India and working in the country.","created_at":"2023-03-27T17:24:46.199751700Z"},{"article_id":130,"rss_id":1,"title":"Nitu Chandra remembers late Pradeep Sarkar: He was grappling with a lot of health issues","summary":"For actor Nitu Chandra, filmmaker Pradeep Sarkar’s demise is more like a personal loss, as she is very close to his family","created_at":"2023-03-27T17:24:46.225671500Z"},{"article_id":131,"rss_id":1,"title":"'Where will Dhoni play? He batted well last year but...': Ex-KKR star's 'larger than life' statement for CSK captain","summary":"Under MS Dhoni's leadership, Chennai Super Kings (CSK) will kickstart their Indian Premier League (IPL) campaign against defending champions Gujarat Titans (GT) at the Narendra Modi Stadium in Ahmedabad on Friday.","created_at":"2023-03-27T17:24:46.248026300Z"},{"article_id":132,"rss_id":1,"title":"Valve leaves ‘Left 4 Dead 3’ fans hanging with non-priority status. Can Counter Strike 2 files tell is it coming or not?","summary":"Valve has a reputation for trolling fans with obscure code names hidden in files, but sometimes these turn out to be actual games","created_at":"2023-03-27T17:24:46.266401800Z"},{"article_id":133,"rss_id":1,"title":"UP civil court stenographer Grade III exam admit cards released, get link","summary":"NTA has released admit card for Stenographer Grade-III posts at recruitment.nta.nic.in.","created_at":"2023-03-27T17:24:46.287099900Z"},{"article_id":134,"rss_id":1,"title":"6 tribal festivals to experience the vibrant cultural tapestry of India","summary":"From hornbill to bastar dussehra, these tribal festivals offer a unique insight into the rich cultural heritage of India's indigenous communities.","created_at":"2023-03-27T17:24:46.314398600Z"},{"article_id":135,"rss_id":1,"title":"Putin’s men inflict pain on Ukraine soldiers in Bakhmut; Intense ‘trench battle’","summary":"Ukraine Army has said that there is a 'military necessity' in Bakhmut as it continues to defend the city in the east in the midst of heavy Russian attacks. Ukraine's ground forces commander reportedly visited the eastern frontlines and told Reuters that the situation is constantly difficult in this intense phase of Bakhmut battle. This comes as Russian defence ministry released a new video of the 'trench war' between its soldiers and Ukrainian troops. In the dramatic footage, Russian drones can be seen hunting 'hiding' Ukrainian soldiers and attacking them. Watch this video for more details.","created_at":"2023-03-27T17:24:46.343638700Z"},{"article_id":136,"rss_id":1,"title":"T Ten Global Sports announces Indian Masters T10, set to take place in June 2023","summary":"The thrilling ten-over format matches will take place from the 14th of June 2023 to 28th of June 2023, will consist of 19 matches spread across 12 game days. The tournament will have six franchisees with each team Co-owned by an A-list Bollywood celebrity along with a large corporate house.","created_at":"2023-03-27T17:24:46.371526600Z"},{"article_id":137,"rss_id":1,"title":"Samsung double door refrigerator is perfect for modern kitchen: Top 7 picks","summary":"With their sleek, modern design and a range of features, you'll be able to find the perfect solution for your kitchen with Samsung double door refrigerators.","created_at":"2023-03-27T17:24:46.399883900Z"},{"article_id":138,"rss_id":1,"title":"Modi minister Hardeep Puri's brutal 'Ass and Horse' jibe at Rahul Gandhi amid disqualification row","summary":"Union Minister Hardeep Puri has lashed out at Congress leader Rahul Gandhi after he refused to apologise over Modi Surname case row and said that he was a Gandhi and not VD Savarakar. Watch the video for more details.  Hindustan Times Videos bring you news, views and explainers about current issues in India and across the globe. We’re always excited to report the news as quickly as possible, use new technological tools to reach you better and tell stories with a 360 degree view to give you a better understanding of the world around you.","created_at":"2023-03-27T17:24:46.428775400Z"},{"article_id":139,"rss_id":1,"title":"India's Tawang response haunts Xi Jinping? China skips G20 meet in Arunachal | Report","summary":"China skipped a G20 meeting held on weekend in Arunachal Pradesh's capital Itanagar, media reports said. The reports said that the Chinese delegation did not join meeting in the border state, which it claims as its own, and has previously objected to the visits by foreign leaders and also the Indian leaders to the state. Watch the video for more.   Hindustan Times Videos bring you news, views and explainers about current issues in India and across the globe. We’re always excited to report the news as quickly as possible, use new technological tools to reach you better and tell stories with a 360 degree view to give you a better understanding of the world around you.","created_at":"2023-03-27T17:24:46.457866600Z"},{"article_id":140,"rss_id":1,"title":"Mumbai's Thane West most searched place for home buying in 2022: Survey","summary":"Bengaluru, Mumbai, and Hyderabad took the lion's share in searches and queries for renting a home in 2022.","created_at":"2023-03-27T17:24:46.486957500Z"},{"article_id":141,"rss_id":1,"title":"‘Save Democracy’ placards, papers fly. No end to Lok Sabha chaos","summary":"Outside of Parliament, lawmakers from 18 opposition parties came together to voice their concerns, dressed in black and waving posters that warned of the looming threat to India's democratic values.","created_at":"2023-03-27T17:24:46.515916600Z"},{"article_id":142,"rss_id":1,"title":"‘It gives you motivation to give your best shot’: Rayudu's assurance to CSK fans, says ‘IPL 2023 feels like real IPL’","summary":"Unlike the last few editions, which was majorly impacted with Covid-19, the forthcoming season will involve a lot of traveling as IPL returns to it's traditional home and away format.","created_at":"2023-03-27T17:24:46.544029800Z"},{"article_id":143,"rss_id":1,"title":"Woman’s rendition of qawwali on Lord Krishna wins over people. Watch","summary":"The video that captures a woman singing the famous qawwali Kanhaiya, Yaad Hai Kuchh Bhi Hamaari was shared on Twitter. ","created_at":"2023-03-27T17:24:46.573035100Z"},{"article_id":144,"rss_id":1,"title":"India's record heat waves to limit of human survival?","summary":"The national weather office has forecast rising temperatures in the coming weeks after India experienced its hottest February since 1901.","created_at":"2023-03-27T17:24:46.602571800Z"},{"article_id":145,"rss_id":1,"title":"Contemporary Twist on India's Rich Heritage: Vidhi Singhania Launches New Store in New Delhi","summary":"Step into a World of Regal Threads and Impeccable Craftsmanship","created_at":"2023-03-27T17:24:46.633593600Z"},{"article_id":146,"rss_id":1,"title":"Netflix gets legal notice for The Big Bang Theory's 'offensive and deeply hurtful' line on Madhuri Dixit","summary":"Political analyst Mithun Vijay Kumar sent a legal notice to Netflix seeking removal of The Big Bang Theory from the streaming platform.","created_at":"2023-03-27T17:24:46.664409500Z"},{"article_id":147,"rss_id":1,"title":"Seven-year-old found dead in a sack; mobs blocks roads, torches Kolkata police vehicles","summary":"The girl was missing since Sunday morning and after an extensive search, policemen found her body in one of the flats in an apartment block in the locality.","created_at":"2023-03-27T17:24:46.702324800Z"},{"article_id":148,"rss_id":1,"title":"'Rahul Gandagi': BJP's Poonam Mahajan over Congress leader's Savarkar remark","summary":"BJP MP from Poonam Mahajan took a dig at Congress leader Rahul Gandhi over his remarks on VD Savarkar and said he can never be Savarkar as he is taking the country towards the dirt.","created_at":"2023-03-27T17:24:46.747862300Z"},{"article_id":149,"rss_id":1,"title":"Rahul Gandhi asked to vacate govt bungalow, gets deadline","summary":"The Congress leader was disqualified as a Lok Sabha member, therefore he is not entitled to a government accommodation anymore.","created_at":"2023-03-27T17:24:46.789254100Z"},{"article_id":150,"rss_id":1,"title":"Breaking the Barriers of Sound: Innovative Project Management Services, V-Guard & Christian Hospital Society join forces","summary":"To bring relief to children and adolescents suffering from hearing loss and deafness, V-Guard Industries has partnered with Christian Hospital Society, a non-profit organisation based in Uttar Pradesh","created_at":"2023-03-27T17:24:46.824579300Z"},{"article_id":151,"rss_id":1,"title":"Lok Sabha MPs from Oppn throw papers at Speaker | Rahul Disqualification Row","summary":"The Lok Sabha witnessed unprecedented uproar as opposition MPs escalated protest over Rahul Gandhi's disqualification. Dressed in black, the opposition MPs began raising slogans as soon as the house proceedings commenced. But the Lok Sabha was adjourned in less than a minute after protesting opposition MPs hurled papers at the Chair and raised slogans. After the Speaker left the hall, a banner was also thrown at the chair. Later, opposition MPs marched from the Mahatma Gandhi statue in the parliament premises to Vijay Chowk. Sonia Gandhi and Congress President Mallikarjun Kharge were also present. Watch this video for details. ","created_at":"2023-03-27T17:24:46.855076500Z"},{"article_id":152,"rss_id":1,"title":"Why the WPL was a special experience","summary":"Women’s cricket appeals to the aesthetic form with the bat and trajectory, loop, dip and swerve with the ball.","created_at":"2023-03-27T17:24:46.884985100Z"},{"article_id":153,"rss_id":1,"title":"Top Immigration Consultants in India","summary":"Oasis Resource Management has over a decade of expertise in the immigration market and has assisted many customers in obtaining visas and permanent residency","created_at":"2023-03-27T17:24:46.909789900Z"},{"article_id":154,"rss_id":1,"title":"Spaze Group’s ‘Grandest Jackpot Carnival’ Creates Buzz Among Investors","summary":"The offer will allow buyers to own some of the finest commercial spaces by Spaze Group in Gurugram","created_at":"2023-03-27T17:24:46.930091300Z"},{"article_id":155,"rss_id":1,"title":"Polygon (MATIC) market cap to be surpassed by rival RenQ Finance (RENQ)","summary":"Let's take a closer look at what makes RenQ Finance (RENQ) stand out and why it has the potential to become a major player in the DeFi space","created_at":"2023-03-27T17:24:46.949798400Z"},{"article_id":156,"rss_id":1,"title":"Drugs worth  ₹32 cr seized in Assam’s Karimganj & Cachar; 5 arrested: Police","summary":"The consignment was coming from Mizoram’s capital Aizawl and the peddlers wanted to transport it to Bangladesh through Agartala","created_at":"2023-03-27T17:24:46.990519Z"},{"article_id":157,"rss_id":1,"title":"Best SEO Companies for Small Business","summary":"The best SEO companies for small businesses and startups are listed below based on quality, experience, and proficiency","created_at":"2023-03-27T17:24:47.014893300Z"},{"article_id":158,"rss_id":1,"title":"Diana Penty sets temperature soaring in unbuttoned denim, cropped t-shit","summary":"Diana Penty takes street fashion to a whole new level with her latest photoshoot pictures in a white cropped t-shirt and unbuttoned ripped denim.","created_at":"2023-03-27T17:24:47.034375400Z"},{"article_id":159,"rss_id":1,"title":"Another Amritpal Singh aide booked under NSA shifted from Punjab to Assam jail","summary":"Pro-Khalistani leader Amritpal Singh’s gunman, identified as Varinder Johal, is the eighth detainee from Punjab to be shifted to Assam’s Dibrugarh Central Jail in nine days","created_at":"2023-03-27T17:24:47.054326100Z"},{"article_id":160,"rss_id":1,"title":"Top 10 .Net Development Companies in India 2023","summary":"If your business relies on digital communication, it’s beneficial to use Dotnet because its programmers are skilled at building a company’s internet presence","created_at":"2023-03-27T17:24:47.076336100Z"},{"article_id":161,"rss_id":1,"title":"New-age consulting firm Cognitute enters India, bringing outcome-driven strategies to Startups","summary":"For women entrepreneurs and startups, Cognitute can provide help to build sustainable operating models to generate steady growth ","created_at":"2023-03-27T17:24:47.097064100Z"},{"article_id":162,"rss_id":1,"title":"Top 10 touchscreen laptops of 2023: Comprehensive guide","summary":"Having trouble finding the best touchscreen laptops of 2023? Our guide provides an in-depth look at the top 10 laptops with detailed note of features.","created_at":"2023-03-27T17:24:47.117226600Z"},{"article_id":163,"rss_id":1,"title":"UP Police brings Atiq Ahmed to Prayagraj amid tight security","summary":"On its way to Prayagraj on Monday morning, a vehicle in the convoy carrying Ahmed hit a cow in Shivpuri district. A video of the incident which occurred at around 6:25 AM shows a cow darting towards the road when it was hit by the vehicle carrying Ahmed.","created_at":"2023-03-27T17:24:47.140488800Z"},{"article_id":164,"rss_id":1,"title":"Is your pet at risk? 5 genetic disorders every pet owner should know about","summary":"Genetic disorders in pets can be a source of concern for pet owners as they can affect the health and well-being of their furry companions. Here are some of the most common genetic disorders in pets. ","created_at":"2023-03-27T17:24:47.161264700Z"},{"article_id":165,"rss_id":1,"title":"Tips on how to travel safely and comfortably with your dog in India","summary":"Want to take your dog with you on a trip but worried about their safety and comfort? Here are some tips for travelling with your dog in India.","created_at":"2023-03-27T17:24:47.189191300Z"},{"article_id":166,"rss_id":1,"title":"Revolutionizing student living: The Hive Hostels shares robust expansion plans","summary":"With its cutting-edge facilities and modern, classy approach to luxury living, The Hive Hostels has emerged as the preferred choice among students","created_at":"2023-03-27T17:24:47.212814600Z"},{"article_id":167,"rss_id":1,"title":"Get Ready to Thrive in the Fast-Paced World of Business with SCMS Nagpur's BBA Programme; Apply Now","summary":"SCMS Nagpur's BBA programme offers a range of unique benefits, including an amazing campus life with on-campus events and fests, clubs and committees","created_at":"2023-03-27T17:24:47.233414700Z"},{"article_id":168,"rss_id":1,"title":"Nawazuddin Siddiqui files defamation suit against ex wife and brother, seeks  ₹100 crore in damages","summary":"Nawazuddin Siddiqui filed a defamation case against Aaliya Siddiqui and brother Shamasuddin Siddiqui. He demanded  ₹100 crore and a written apology letter.","created_at":"2023-03-27T17:24:47.253789800Z"},{"article_id":169,"rss_id":1,"title":"Chhattisgarh: Two killed in alleged tiger attack, say forest officials","summary":"The incident took place at around 7am near the forest of Kalamanjan village in Odgi development block when the three persons were out in the jungle to collect wood","created_at":"2023-03-27T17:24:47.275296900Z"},{"article_id":170,"rss_id":1,"title":"Aludecor Partners with IIT Gandhinagar to Deliver its #BeatTheFire Pledge","summary":"Institute’s state-of-the-art facilities used to research fire retardant properties of Aludecor's FR ACP Sheets, bringing hope for safer buildings in India","created_at":"2023-03-27T17:24:47.296289900Z"},{"article_id":171,"rss_id":1,"title":"Protests, national strikes in Israel after Netanyahu fires defence minister","summary":"Tens of thousands of people burst into the streets around Israel on the night of March 26 in a spontaneous show of anger at Prime Minister Benjamin Netanyahu’s decision to fire his defense minister after he called for a pause on a proposed judicial overhaul.&nbsp;Chanting “the country is on fire,” they lit bonfires on Tel Aviv's main highway, closing the throughway and many others throughout the country for hours.&nbsp;The overhaul, driven by Netanyahu, who is on trial for corruption, and his allies in Israel's most right-wing government ever, has plunged Israel into one of its worst domestic crises, AP reported.","created_at":"2023-03-27T17:24:47.321510100Z"},{"article_id":172,"rss_id":1,"title":"Putin's troops shoot down U.S-made drones; Russia foils Ukraine drone attack","summary":"The ongoing conflict between Russia and Ukraine is escalating into an all-out drone war. Moscow says it has downed an explosives-laden Ukrainian drone in the town of Kireyevsk. Russian authorities say at least three people were injured in an explosion and several apartments were reportedly damaged after the drone was brought down. Meanwhile, in Zaporizhzhia, Russian troops shot down U.S-made drones using rifles. Russian authorities claim the drones were allegedly used to drop canisters of chemical weapons at its troops deployed. Watch this video for details. ","created_at":"2023-03-27T17:24:47.350302Z"},{"article_id":173,"rss_id":1,"title":"JKPSC recruitment 2023: Veterinary Assistant Surgeon posts notified","summary":"JKPSC invited applications for Veterinary Assistant Surgeon posts.","created_at":"2023-03-27T17:24:47.371856300Z"},{"article_id":174,"rss_id":1,"title":"Caterpillar's camouflaging skills will leave you stunned. Watch","summary":"A common baron caterpillar whose camouflaging skills are on the next level. ","created_at":"2023-03-27T17:24:47.400532300Z"},{"article_id":175,"rss_id":1,"title":"SFJ chief’s threat to CM Dhami made through spoofed numbers: Uttarakhand police","summary":"A recorded message received by media personnel and government officials threatened to raise Khalistani flags during G-20 summit at Nainital’s Ramnagar and warned chief minister Pushkar Singh Dhami against taking action against Sikhs in the state","created_at":"2023-03-27T17:24:47.420328100Z"},{"article_id":176,"rss_id":1,"title":"Nitish Rana named KKR captain for IPL 2023 as Shreyas Iyer recovers from injury","summary":"Kolkata Knight Riders have appointed Nitish Rana as their captain for IPL 2023.","created_at":"2023-03-27T17:24:47.439636800Z"},{"article_id":177,"rss_id":1,"title":"‘Congress is left with black magic now’: Piyush Goyal","summary":"Addressing the press, Union minister Piyush Goyal slammed the Congress and other Opposition parties for ‘disrespecting’ the Parliament amid protests. ","created_at":"2023-03-27T17:24:47.460508600Z"},{"article_id":178,"rss_id":1,"title":"5 best Pepe Jeans' denims for men: Shopper's guide","summary":"Pepe jeans have a great fit and rank high on comfort. Read on to see our top 5 picks.","created_at":"2023-03-27T17:24:47.480733300Z"},{"article_id":179,"rss_id":1,"title":"Airtel 5G Plus: The Ultimate Game Changer for On-the-Go Gaming!","summary":"The network is offering Wi-Fi-like speeds and an introductory offer of unlimited 5G data, enabling gamers to enjoy their favourite games with seamless experience. Find out more!","created_at":"2023-03-27T17:24:47.500315200Z"},{"article_id":180,"rss_id":1,"title":"LG 205L 4-star refrigerator is ideal for scorching summer","summary":"The LG 205L 4-star refrigerator comes with multiple features and keeps food fresh for a long time.","created_at":"2023-03-27T17:24:47.519715300Z"},{"article_id":181,"rss_id":1,"title":"Bengaluru's Ejipura flyover makes it to Google  monuments list, Twitter reacts","summary":"the Ejipura flyover turned out to be a viral sensation after it was marked as a must visit monument in Google locations, taking a sarcastic dig at the government's blind eye towards this 6-year-old unfinished project.","created_at":"2023-03-27T17:24:47.539807400Z"},{"article_id":182,"rss_id":1,"title":"75% of second harvest of alphonso mangoes hit by heatwave","summary":"Strap: Around three-fourth of the fruit’s production in the longer second phase of the harvest might have been lost due to the heatwave, farmers in Devgad and Ratnagiri districts said, as flowers wilted and unripe mangoes fell to the groundMumbai An unseasonal heatwave between February 25 and March 6 in the Konkan has impacted the famed Alphonso orchards in Devgad and Ratnagiri districts of Maharashtra, and farmers fear a loss of as much a three-fourths of the crop in its second ripening between mid-April till end of May","created_at":"2023-03-27T17:24:47.561910Z"},{"article_id":183,"rss_id":1,"title":"De Dhakka 2, A Hilarious Family Comedy Drama, Streaming Now On ZEE5 Global","summary":"De Dhakka 2 is written by Pratap Phad, co-directed by Mahesh and Sudesh Manjrekar, and produced by Yatin Jadhav and Swati Khopkar","created_at":"2023-03-27T17:24:47.583381100Z"},{"article_id":184,"rss_id":1,"title":"Putin's World War III warning? 'NATO building WW II-style bloc', claims Russian President | Watch","summary":"Russian President Vladimir Putin has made a stunning claim against the U.S.-led NATO. Putin, whose army has been fighting a war in Ukraine for over a year now, claims that NATO is building a second world-war-style alliance. Putin said that the U.S. is creating new alliances using NATO’s new strategic concept, which explicitly says it plans to develop relations with Asia-Pacific countries and create a global NATO. The U.S.-led military bloc approved this new concept at the Madrid summit last June, while describing Russia as the 'most significant and direct threat' to NATO. Watch this report for full information.","created_at":"2023-03-27T17:24:47.604812Z"},{"article_id":185,"rss_id":1,"title":"Watch: MS Dhoni says 'it's working', then bursts out laughing after unexpected gesture for CSK fans","summary":"MS Dhoni could be seen giving a helping hand in trying to get the Chepauk Stadium ready for the 2023 season of the IPL.  ","created_at":"2023-03-27T17:24:47.625689500Z"},{"article_id":186,"rss_id":1,"title":"Amritpal Singh protests in Canada: India worried over security at its missions","summary":"The protests have been going on through the week and many others are expected in the days ahead as anti-India groups, including Khalistani elements seek to leverage developments related to Amritpal Singh, leader of Waris Punjab De, to further their own agenda","created_at":"2023-03-27T17:24:47.646470200Z"},{"article_id":187,"rss_id":1,"title":"Janhvi Kapoor teases Varun Dhawan for comically small sunglasses; actor has a hilarious comeback","summary":"Janhvi Kapoor commented on Varun Dhawan's latest Instagram post, which didn't fail to catch the attention of the actor. He responded soon after.","created_at":"2023-03-27T17:24:47.666615100Z"},{"article_id":188,"rss_id":1,"title":"'Apni mithi, dal chawal...': Guneet Mongra reveals how she celebrated her Oscar win","summary":"It was a Super Sunday evening as all the roads led to JW Marriott hotel in Mumbai for OTTPlay Awards honouring the changemakers in the field of entertainment. The red carpet glittered with the golden shine of Oscar-winner Guneet Monga who missed her 'mithi and ghar ka daal chawal' in Los Angeles. Watch the highlights of the OTTPlay Changemakers 2023 red carpet. ","created_at":"2023-03-27T17:24:47.688107800Z"},{"article_id":189,"rss_id":1,"title":"Rajkummar, Munawar Faruqui win big at OTTPlay ChangeMakers Awards | Watch best moments","summary":"The first edition of the OTTPlay Changemakers Awards by Hindustan Times celebrated the pioneers, groundbreakers, and trend-setters of the entertainment industry. Guneet Monga, the producer of the documentary film that won India an Oscar, was awarded the 'Changemaker of the Year' title for 2023. Actor Rajkummar Rao, who has been receiving rave reviews for his performance in 'Bheed,' won the \"Pathbreaking Performer of the Year’ honour. Watch the best moments from the glittering ceremony. ","created_at":"2023-03-27T17:24:47.710524900Z"},{"article_id":190,"rss_id":1,"title":"Jimin, Suga and J-Hope can't stop laughing as they dance to Like Crazy, BTS fans say: 'This is driving us crazy'. Watch","summary":"BTS: Suga and J-Hope joined Jimin as they grooved to his new song Like Crazy. BTS fans said that they are ‘unable to handle this much cuteness’. Watch videos.","created_at":"2023-03-27T17:24:47.732210200Z"},{"article_id":191,"rss_id":1,"title":"Centre, Gujarat govt get SC notice on Bilkis Bano plea against 11 convicts' premature release","summary":"The Supreme Court issued a notice to the Centre and Gujarat government in a petition filed by Bilkis Bano against the premature release of 11 people convicted of her gangrape and murdering her family members","created_at":"2023-03-27T17:24:47.752559Z"},{"article_id":192,"rss_id":1,"title":"Cardiac arrest more likely to cause long-term anxiety in women than men: Study","summary":"According to a study presented today at ESC Acute CardioVascular Care 2023, a scientific gathering of the European Society of Cardiology, more women than men experience anxiety four months after a cardiac arrest (ESC)","created_at":"2023-03-27T17:24:47.772807800Z"},{"article_id":193,"rss_id":1,"title":"5 best Xiaomi smartphones with 5G capability","summary":"This article guides you to find some of the best Xiaomi smartphones that are 5G compatible - from their price to new release.","created_at":"2023-03-27T17:24:47.793254200Z"},{"article_id":194,"rss_id":1,"title":"'If Kapil Dev says he wants to give advice...': Abdul Razzaq breaks silence on controversial remark on Hardik Pandya","summary":"Former Pakistan all-rounder Abdul Razzaq had earlier claimed that superstar Hardik Pandya is not as good as legendary cricketer Kapil Dev. Pandya will lead defending champions Gujarat Titans in the upcoming edition of the Indian Premier League (IPL).","created_at":"2023-03-27T17:24:47.818350500Z"},{"article_id":195,"rss_id":1,"title":"'I was only 22 and to hear something like that...': Sachin Tendulkar reacts to 'massive statement' made towards him","summary":"As Tendulkar demolished bowling attacks, the world stood and took notice. Praises and compliments not only from India, but across the world started pouring in.","created_at":"2023-03-27T17:24:47.838764100Z"},{"article_id":196,"rss_id":1,"title":"Evening brief: India wants to be part of solution for climate change, says environment minister, and all the latest news","summary":"Here are today’s top news, analysis, and opinion. Know all about the latest news and other news updates from Hindustan Times.","created_at":"2023-03-27T17:24:47.860813800Z"},{"article_id":197,"rss_id":1,"title":"Sun signs in love: Libra women as lovers","summary":"Is it the inner beauty that attracts you to someone or the outer appearance? Love is different for all. Let's find out how it is for Libras. ","created_at":"2023-03-27T17:24:47.883205400Z"},{"article_id":198,"rss_id":1,"title":"5 most expensive Bollywood costumes ever worn by stars","summary":"From Madhuri Dixit's red lehenga in Devdas to Deepika's luxurious costume in Bajirao Mastani, here are some of the most expensive Bollywood costumes ever worn by stars.","created_at":"2023-03-27T17:24:47.913263600Z"},{"article_id":199,"rss_id":1,"title":"Ranbir Kapoor puts arms around Alia Bhatt as they walk on London street, visit park and explore city","summary":"Alia Bhatt had a good time in London where she celebrated her 30th birthday. She was joined by husband Ranbir Kapoor and others.","created_at":"2023-03-27T17:24:47.942957700Z"},{"article_id":200,"rss_id":1,"title":"Virat Kohli recalls how his plans to surprise Anushka Sharma at airport failed: 'Chance hi nahi hai isko pata hoga'","summary":"Virat Kohli said he wanted to surprise Anushka Sharma last month at Mumbai airport. However, the actor somehow figured it out.","created_at":"2023-03-27T17:24:47.965562600Z"},{"article_id":201,"rss_id":1,"title":"Laughing gas to be banned in UK to curb anti-social behaviour","summary":"“Anti-social behaviour undermines the basic right of people to feel safe in the place they call home,” said PM Sunak.","created_at":"2023-03-27T17:24:47.986293700Z"},{"article_id":202,"rss_id":1,"title":"Amitabh Bachchan wears ‘homemade sling’ as he meets fans at Jalsa first time since injury: ‘They wait and watch…’","summary":"Amitabh Bachchan wore a ‘homemade sling’ as he greeted his fans at Jalsa for the first time since his injury on Project K sets. He shared several pictures.","created_at":"2023-03-27T17:24:48.008546500Z"},{"article_id":203,"rss_id":1,"title":"RR sign discarded India pacer as injured Prasidh Krishna's replacement","summary":"Rajasthan Royals was ruled out of the 2023 season of the IPL after a surgery for a lumbar stress fracture in his spine. ","created_at":"2023-03-27T17:24:48.035117800Z"},{"article_id":204,"rss_id":1,"title":"‘If Pathans and Bengalis channelise…’: Shoaib Akhtar's out-of-box take on Afghanistan's historic win vs Pakistan","summary":"Former Pakistan speedster Shoaib Akhtar was mighty impressed with Afghanistan's effort and predicted them to be one of the “best” teams heading into the 50-over World Cup","created_at":"2023-03-27T17:24:48.063449Z"},{"article_id":205,"rss_id":1,"title":"Taiwan’s former Prez Ma lands in China in landmark, controversial visit","summary":"Former Taiwanese President Ma Ying-jeou landed in Shanghai on Monday afternoon, the first former leader of the self-ruled island to do so in nearly seven decades, in a visit that he said was an effort to “lower heightened political and military tension between the two sides”","created_at":"2023-03-27T17:24:48.089362Z"},{"article_id":206,"rss_id":1,"title":"Salicylic acid body washes soothe skin, unclog pores","summary":"Body washes with Salicylic acid in them have great cleansing and exfoliating properties. Read on to see top picks.","created_at":"2023-03-27T17:24:48.114418700Z"},{"article_id":207,"rss_id":1,"title":"APPSC Group 4 Mains hall ticket 2023 released at psc.ap.gov.in, get link","summary":"APPSC released the exam hall tickets for the post of Junior Assistant cum Computer Assistant (Group 4) services.","created_at":"2023-03-27T17:24:48.188389100Z"},{"article_id":208,"rss_id":1,"title":"Reasons Why Club Mahindra Kandaghat Makes for the Best Holiday Destination near Shimla","summary":"Popularly known by its moniker, ‘the Queen of hill stations,’ the city is a gateway to all your Himalayan adventures","created_at":"2023-03-27T17:24:48.231510900Z"},{"article_id":209,"rss_id":1,"title":"Toyota showcases Modellista and GR Sport, 2 new variants of Fortuner SUV","summary":"Both variants were displayed at the ongoing Bangkok International Motor Show, and may be launched in India as well in the near future.","created_at":"2023-03-27T17:24:48.271684600Z"},{"article_id":210,"rss_id":1,"title":"Saudi Aramco to buy 10% stake in China oil refinery for $3.6 billion","summary":"Saudi Aramco will supply 4,80,000 barrels of crude oil per day to Rongsheng Petrochemical's refinery in the eastern province of Zhejiang over a 20-year period.","created_at":"2023-03-27T17:24:48.304325500Z"},{"article_id":211,"rss_id":1,"title":"Ram Navami 2023: 5 prasad items you should make during kanjak","summary":"Ram Navami 2023: Check out five prasad items that you can make during Kanjak to make the festival even more special and memorable.","created_at":"2023-03-27T17:24:48.347176500Z"},{"article_id":212,"rss_id":1,"title":"India wants to be part of solution, not problem, in climate change debate: Yadav","summary":"Union minister for environment, forest and climate change Bhupender Yadav said India’s focal point for COP 28 will revolve around the issues that were not completed in the last COP","created_at":"2023-03-27T17:24:48.380417900Z"},{"article_id":213,"rss_id":1,"title":"US meteorologist uses FRIENDS references in weather report. Netizens say ‘love this’","summary":"Houston weatherman Adam Krueger is known for his creative weather reports.","created_at":"2023-03-27T17:24:48.415685700Z"},{"article_id":214,"rss_id":1,"title":"Exploring Pristine and Picturesque Munnar with Club Mahindra","summary":"Like all hill stations in India, Munnar has pleasant climatic conditions throughout the year. But the best time to visit Munnar is between September to February","created_at":"2023-03-27T17:24:48.459155800Z"},{"article_id":215,"rss_id":1,"title":"Banjaras hurl stones at Yediyurappa’s residence in Shikaripura; Sec 144 imposed","summary":"Several policemen and women protestors were also reportedly injured due to stone pelting. The angry mob also burnt posters of Yediyurappa and Chief Minister Basavaraj Bommai.","created_at":"2023-03-27T17:24:48.503782900Z"},{"article_id":216,"rss_id":1,"title":"Succession season 4 premiere recap: The Roys return for a round of humiliations and broken contracts","summary":"The highly-anticipated fourth season of the hit HBO series “Succession” premiered on March 26, and it did not disappoint","created_at":"2023-03-27T17:24:48.541066900Z"},{"article_id":217,"rss_id":1,"title":"Metallic nail paints are perfect to glam up any look","summary":"Metallic nail paints look super attractive and come with high definition sheen. Read on to see our top picks. ","created_at":"2023-03-27T17:24:48.578070700Z"},{"article_id":218,"rss_id":1,"title":"7 best ultra short throw projectors: Shopper's manual","summary":"Get an ultra short throw projector at home to elevate viewing experience. Read on to see our top selections.","created_at":"2023-03-27T17:24:48.598460700Z"},{"article_id":219,"rss_id":1,"title":"Elon Musk's Neuralink on hunt for human trail partner. Why?","summary":"Neuralink suffered a blow in early 2022, when the U.S. Food and Drug Administration rejected its application to progress to human trials, citing major safety concerns. ","created_at":"2023-03-27T17:24:48.619578700Z"},{"article_id":220,"rss_id":1,"title":"Unwind at Club Mahindra Ashtamudi Floating Cottages","summary":"During your stay at the Club Mahindra Ashtamudi resort, you can be sure to have a delightful dining experience as well","created_at":"2023-03-27T17:24:48.635914800Z"},{"article_id":221,"rss_id":1,"title":"BS Yediyurappa's home attacked; 'Banjaras misunderstood...', he says","summary":"The Banjara community has urged the government to drop the Justice A J Sadashiva Commission report recommending proportional representation to sub-castes among Scheduled Castes (SC)","created_at":"2023-03-27T17:24:48.652703700Z"},{"article_id":222,"rss_id":1,"title":"Amit Shah chairs BJP core committee meeting in B'luru to discuss poll strategy","summary":"BJP National Organizing General Secretary BL Santhosh, co-in-charges Man Sukh Mandaviya, Annamalai, CM Basavaraj Bommai, ex-CM BS Yediyurappa, Union Minister Prahlad Joshi, State President Naleen Kumar Kateel, Union Minister Shobha Karandlaje and other core committee and election management committee members were present in the meeting.","created_at":"2023-03-27T17:24:48.667846Z"},{"article_id":223,"rss_id":1,"title":"Mi phones for photography: Top 5 picks for picture-perfect shots","summary":"Discover the top 5 Mi phones with high-quality cameras for breathtaking photography. From Mi 11X Pro 5G to Xiaomi 11i 5G, we've got you covered.","created_at":"2023-03-27T17:24:48.687241900Z"},{"article_id":224,"rss_id":1,"title":"Uddhav Thackeray faction boycotts Congress meet over Rahul Gandhi's Savarkar remarks","summary":"The Uddhav Thackeray faction decided not to attend the meeting at Mallikarjun Kharge's residence over Rahul Gandhi's “I am not Savarkar, I am Gandhi” comments.","created_at":"2023-03-27T17:24:48.705925900Z"},{"article_id":225,"rss_id":1,"title":"Monday Musings: Pune Metro will soon expand service, it’s time people change mindset","summary":"As per regional transport office (RTO) figures, there are around four million vehicles in Pune, close to its overall population. Metro, as the global experience goes, hopes to encourage people to shun private vehicles and instead use mass transport","created_at":"2023-03-27T17:24:48.725230900Z"},{"article_id":226,"rss_id":1,"title":"SCC Constable GD Results 2023 live updates: Result expected soon ssc.nic.in","summary":"SSC Constable GD Result 2023 live updates: SSC Constable GD Result 2022 in due course of time. Follow for updates.","created_at":"2023-03-27T17:24:48.762058800Z"},{"article_id":227,"rss_id":1,"title":"7 serene Goa beaches to get away from crowd and party scenes","summary":"Goa is a popular tourist destination. And if you're looking for a more peaceful beach experience, here are 7 beaches perfect for getting away from the crowd.","created_at":"2023-03-27T17:24:48.808237600Z"},{"article_id":228,"rss_id":1,"title":"Jennifer Aniston on her very 'heavy' Manish Malhotra lehenga in Murder Mystery 2: 'So much respect for women of India'","summary":"Jennifer Aniston has worn a silver lehenga by Manish Malhotra's dress in her film, Murder Mystery 2.","created_at":"2023-03-27T17:24:48.852341800Z"},{"article_id":229,"rss_id":1,"title":"Sensex up by 127 points to close at over 57,650, Nifty at 16,986","summary":"Among the Sensex firms, Reliance Industries, Maruti, Sun Pharma, State Bank of India, UltraTech Cement, Infosys, Kotak Mahindra Bank, Hindustan Unilever, ITC and HDFC Bank were the biggest gainers.","created_at":"2023-03-27T17:24:48.900175700Z"},{"article_id":230,"rss_id":1,"title":"AAP to move 4 resolutions for relief to traders during MCD session","summary":"Durgesh Pathak, AAP’s MCD in charge, said the corporation exploited traders over the 15 years the BJP controlled it","created_at":"2023-03-27T17:24:48.947150500Z"},{"article_id":231,"rss_id":1,"title":"Anshula Kapoor makes her relationship with Rohan Thakkar Instagram official, fans call it ‘match made in heaven’","summary":"Anshula Kapoor and Rohan Thakkar shared a photo from the Maldives and made their relationship Instagram official. They celebrated their year anniversary.","created_at":"2023-03-27T17:24:48.990300700Z"},{"article_id":232,"rss_id":1,"title":"Delhi Police PE&MT  hall ticket out for Constable (Driver) Male, link here","summary":"Delhi Police PST/PET call letter released for the Constable (Driver) post.","created_at":"2023-03-27T17:24:49.034294800Z"},{"article_id":233,"rss_id":1,"title":"Dr Palash Sen: Dhoom Pichak became a hit because of Pradeep dada","summary":"Pop rock band Euphoria’s frontman, Dr Palash Sen, shared a close bond with Pradeep Sarkar","created_at":"2023-03-27T17:24:49.081426800Z"},{"article_id":234,"rss_id":1,"title":"Amritpal Singh hiding in Nepal? Indian embassy seeks  help","summary":"\"The esteemed ministry is requested to inform the Department of Immigration not to permit Amritpal Singh to travel through Nepal for any third country and arrest him if he attempts to escape from Nepal using Indian Passport or any other fake passport under intimation to this mission,” a letter sent to the Department of Consular Services on Saturday said.","created_at":"2023-03-27T17:24:49.109624200Z"},{"article_id":235,"rss_id":1,"title":"Will RBI increase repo rate in next policy meet? What report says","summary":"At the latest Monetary Policy Committee (MPC) of the RBI in early February, it decided to raise the repo rate by 25 basis points to 6.5 per cent.","created_at":"2023-03-27T17:24:49.135004400Z"},{"article_id":236,"rss_id":1,"title":"A supermassive blackhole is directly facing Earth: Scientists","summary":"The research published on March 21 has revealed that the galaxy has now been classified as a giant radio galaxy that is four million light years across.","created_at":"2023-03-27T17:24:49.158055300Z"},{"article_id":237,"rss_id":1,"title":"Tyla Yaweh: I would love to explore Bollywood music","summary":"The American rapper, who was in India recently, talks about his love for India and the country’s music.","created_at":"2023-03-27T17:24:49.174663800Z"},{"article_id":238,"rss_id":1,"title":"Punjab CM announces audit to assess weather-induced crop loss","summary":"CM Bhagwant Mann said Punjab government officials will meet farmers from a particular village designated to them to get the information on crop loss","created_at":"2023-03-27T17:24:49.193526100Z"},{"article_id":239,"rss_id":1,"title":"JEE Main 2023 session 2 exam city slip soon on jeemain.nta.nic.in","summary":"JEE Main 2023 session 2 exam city slip and admit card will be issued on jeemain.nta.nic.in. ","created_at":"2023-03-27T17:24:49.214174600Z"},{"article_id":240,"rss_id":1,"title":"6 most iconic Bollywood movie costumes that became fashion trends","summary":"From Madhubala in Mughal-E-Azam to Kareena Kapoor in Jab We Met, here are Bollywood's six most iconic outfits that became fashion trends.","created_at":"2023-03-27T17:24:49.285062300Z"},{"article_id":241,"rss_id":1,"title":"'Joining an exceptional team in India': Steve Smith confirms return to IPL in 2023, KKR fans can't keep calm","summary":"Smith confirmed his participation through a video on his social media handle and while he did not name his team, fans of Kolkata Knight Riders (KKR) couldn't keep calm.","created_at":"2023-03-27T17:24:49.316138800Z"},{"article_id":242,"rss_id":1,"title":"Real estate agent, 42, killed in Puducherry: Police","summary":"Puducherry BJP’s media convenor P Gurushankaran said Senthil Kumaran was in-charge of the BJP’s Mangalam  assembly segment but the murder was not linked to politics or the party","created_at":"2023-03-27T17:24:49.335113400Z"},{"article_id":243,"rss_id":1,"title":"Watch: Rovman Powell's freak spiderman-like dive over boundary ropes to prevent hurting two kids working as ball-boys","summary":"Rovman Powell attempted a spiderman-like dive over the boundary ropes to prevent hurting two kids, who were working as ball-boys, during the 2nd T20I between South Africa and West Indies.","created_at":"2023-03-27T17:24:49.355706900Z"},{"article_id":244,"rss_id":1,"title":"BJP's Suvendu Adhikari says TMC not a political party, but…","summary":"Leader of opposition in the West Bengal assembly on Monday criticised the Mamata Banerjee-led state government after the chief minister decided a two-day sit-in against the Centre.","created_at":"2023-03-27T17:24:49.375739300Z"},{"article_id":245,"rss_id":1,"title":"‘Wait for few weeks’: Ashwini Vaishnaw to question on Indian version of ChatGPT","summary":"Union minister for electronics and information technology Ashwini Vaishnaw said that not a single startup in India was affected in the aftermath of the Silicon Valley Bank (SVB) collapse as the government ensured immediate action to help them","created_at":"2023-03-27T17:24:49.396970400Z"},{"article_id":246,"rss_id":1,"title":"Cosmic procession: How to watch rare alignment of 5 planets in night sky this week","summary":"Don't miss out on Tuesday's celestial spectacle! Five planets will lineup in the western horizon after sunset, with Mercury and Jupiter disappearing in just half an hour. ","created_at":"2023-03-27T17:24:49.418348400Z"},{"article_id":247,"rss_id":1,"title":"Fresh AAP v Delhi LG battle after Atishi orders discoms subsidy audit","summary":"Delhi CM Kejriwal has ordered an audit of the subsidy given to discoms to check for any discrepancies. The audit will be carried out by CAG-empanelled agencies and directions will be issued in the next few days.","created_at":"2023-03-27T17:24:49.443463700Z"},{"article_id":248,"rss_id":1,"title":"Orient Electric Aerostorm: High capacity room cooler for summer","summary":"The Orient Electric Aerostorm is a high capacity room cooler with power efficient performance and multiple cooling modes.","created_at":"2023-03-27T17:24:49.475271500Z"},{"article_id":249,"rss_id":1,"title":"Rupee finds temporary ease as India's current account deficit shrinks","summary":"India's current-account deficit is expected to decrease as economists revise their forecasts due to favorable trade trends. This is good news for the rupee, which has been struggling in comparison to other emerging Asian currencies.","created_at":"2023-03-27T17:24:49.505160600Z"},{"article_id":250,"rss_id":1,"title":"World Theatre Day: DU students feel there’s still room for drama","summary":"On World Theatre Day (March 27), the final-year students of dramatics societies of Delhi University, share how they are making the most of their one last chance to celebrate the ‘drama’ of college life. Overcoming challenges such as recruiting new talent that’s reluctant to try their skills and scarcity o college funding, these young guns are trying their best to keep the artiste within them stay alive!","created_at":"2023-03-27T17:24:49.538100300Z"},{"article_id":251,"rss_id":1,"title":"'PM Modi ended democracy': Opposition MPs don black attire; Protest Rahul disqualification","summary":"Rahul Gandhi's disqualification as MP has united the opposition against PM Narendra Modi and ruling BJP-led Union Government. The Opposition MPs today donned the black attire and staged a protest outside Parliament against the Modi Government as they accused the Centre and PM of finishing the democracy in the country. Watch the video for more.  Hindustan Times, owned by HT Media Ltd, is one of India’s largest publications that provides unbiased news, analysis and features on politics, sports, entertainment, lifestyle and more. Hindustan Times delivers the news across all social media platforms, on the web, and at your doorstep.","created_at":"2023-03-27T17:24:49.569775500Z"},{"article_id":252,"rss_id":1,"title":"Amritpal Singh, Bhindranwale billboard in Times Square; Netizens slam 'glorification of terrorists'","summary":"Khalistani preacher and Waris Punjab De chief Amritpal Singh featured on a billboard in Times Square in New York. The billboard also had a picture of Khalistani militant ideologue Jarnail Singh Bhindranwale. This as hunt for the fugitive Amritpal Singh continues in Punjab and neighbouring states, including in Delhi. The billboard, however, angered Indian netizens who accused the US of allowing the glorification of the \"terrorists\" wanted by India on its soil. Watch the video for more.   Hindustan Times, owned by HT Media Ltd, is one of India’s largest publications that provides unbiased news, analysis and features on politics, sports, entertainment, lifestyle and more. Hindustan Times delivers the news across all social media platforms, on the web, and at your doorstep.","created_at":"2023-03-27T17:24:49.599292Z"},{"article_id":253,"rss_id":1,"title":"‘We do responsible hiring’: Flipkart takes stand against mass layoffs","summary":"According to Krishna Raghavan, Flipkart's Chief People Officer, the company does not believe in hiring in bulk as doing so often leads to firms laying off staff to lessen the headcount.","created_at":"2023-03-27T17:24:49.637091500Z"},{"article_id":254,"rss_id":1,"title":"Indian man among two injured in firing on California Gurdwara premises | Watch","summary":"Two people, including an Indian, were shot at in a Sikh Temple in Sacramento in California this morning (Indian Time). PTI reported that the he shooting occurred at around 2:30 pm local time at the Gurudwara Sacramento Sikh Society temple located on the 7600 block of Bradshaw Road in the U.S. state of California. Both victims were rushed to the hospital and are expected to survive. Authorities have said that the incident is not a hate crime and occurred after scuffle between two men. Watch the video for more details.  Hindustan Times, owned by HT Media Ltd, is one of India’s largest publications that provides unbiased news, analysis and features on politics, sports, entertainment, lifestyle and more. Hindustan Times delivers the news across all social media platforms, on the web, and at your doorstep.","created_at":"2023-03-27T17:24:49.718293800Z"},{"article_id":255,"rss_id":1,"title":"Chips omelette fusion dish irks food lovers. Would you give it a try?","summary":"Chips omelette is the latest weird food combination that has irked people. ","created_at":"2023-03-27T17:24:49.766836800Z"},{"article_id":256,"rss_id":1,"title":"Gold and silver prices on March 27: Check rates in your city","summary":"The rate for 24-carat gold was Rs. 5,969 per gram, with 8 and 10 grams priced at Rs. 47,752 and Rs. 59,690, respectively.","created_at":"2023-03-27T17:24:49.817594300Z"},{"article_id":257,"rss_id":1,"title":"UGC NET 2023 result awaited at ugcnet.nta.nic.in","summary":"Candidates can check UGC NET results on ugcnet.nta.nic.in and ntaresults.nic.in, after it is announced.","created_at":"2023-03-27T17:24:49.861325100Z"},{"article_id":258,"rss_id":1,"title":"Watch: Simon Doull, Aamer Sohail argue on live TV, caught in fiery on-air exchange over Babar Azam's strike rate","summary":"While Babar Azam's place in the squad itself is seldom questioned, there is always a debate over whether he should continue to open for Pakistan or come in at No.3","created_at":"2023-03-27T17:24:49.900298500Z"},{"article_id":259,"rss_id":1,"title":"Aryan Khan parties with Roshni Walia and friends, fans wonder ‘Ye hasta kab ha’","summary":"Aryan Khan recently attended a party and joined actor Roshni Walia for pictures. Roshni also promoted Aryan's vodka brand on Instagram.","created_at":"2023-03-27T17:24:49.936583600Z"},{"article_id":260,"rss_id":1,"title":"4G keypad mobile phones: Our top 10 picks","summary":"Looking for a good 4G keypad mobile phone to buy? Then look no further. We have listed 10 of the best ones here, making it easier for you to choose.","created_at":"2023-03-27T17:24:49.977743400Z"},{"article_id":261,"rss_id":1,"title":"Maharashtra man held for alleged murder of co-worker in Thane","summary":"Maharashtra man held for alleged murder of co-worker in Thane factory.","created_at":"2023-03-27T17:24:50.023129Z"},{"article_id":262,"rss_id":1,"title":"Karnataka elections: Football for Gali Janardhan Reddy's KRPP party","summary":"displayed the football symbol on Monday and urged the people of Kalyana Karnataka region to vote for his party. ","created_at":"2023-03-27T17:24:50.065312500Z"},{"article_id":263,"rss_id":1,"title":"After 'three wise monkeys' tweet on Adani row, Mahua Moitra's fresh jab at govt","summary":"Adani-Hindenburg row: Controversy over the US-based short seller's report has expanded to Congress leader Rahul Gandhi's disqualification from the Lok Sabha.","created_at":"2023-03-27T17:24:50.104959500Z"},{"article_id":264,"rss_id":1,"title":"Rahul Gandhi questions PM Modi in 'Modani exposed' tweet: 'Why so much fear?'","summary":"Rahul Gandhi upped the ante against Prime Minister Narendra Modi asking why the public's retirement money is being invested in Adani's companies even after the Hindenburg Research's report on the group.","created_at":"2023-03-27T17:24:50.147995900Z"},{"article_id":265,"rss_id":1,"title":"BSF siezes 6.2 kg heroin dropped by Pakistani drone in Amritsar","summary":"The on-duty BSF personnel opened fire at the drone carrying the heroin near Toor village, which falls under the Amritsar district, but it managed to retreat","created_at":"2023-03-27T17:24:50.188007100Z"},{"article_id":266,"rss_id":1,"title":"Labuschagne's million-dollar reply to fan's 'One word about Rohit Sharma' query; picks dream batting partner from Fab 4","summary":"On Monday, the Australian batter had a small Q&A session with his fans on Twitter where he was asked on various topics ranging from the recently-concluded series against India to his love for coffee and his favourite batter of all time.","created_at":"2023-03-27T17:24:50.238083700Z"},{"article_id":267,"rss_id":1,"title":"Here’s how small businesses can get funds with a Gold Loan","summary":"Keep reading to know how taking a gold loan can help small businesses grow","created_at":"2023-03-27T17:24:50.285993800Z"},{"article_id":268,"rss_id":1,"title":"From vibrant colours to vintage decor: Top interior design trends for spring 2023","summary":"Spring is in the air and so are the hottest interior design trends for 2023! From sustainable materials to bold colours, geometric shapes to maximalism, check out season's most exciting interior decor trends. ","created_at":"2023-03-27T17:24:50.333140500Z"},{"article_id":269,"rss_id":1,"title":"Viral Brain Teaser: Can you find a snake among tortoises?","summary":"The viral brain teaser challenges people to find a snake hidden among tortoises. ","created_at":"2023-03-27T17:24:50.376537700Z"},{"article_id":270,"rss_id":1,"title":"Vivek Agnihotri copies Rahul Gandhi's words when asked about his film Hate Story; Gulshan Devaiah trolls him","summary":"The Kashmir Files director Vivek Agnihotri recently used Rahul Gandhi's lines to respond to a follower who asked him about his earlier directorial, Hate Story.","created_at":"2023-03-27T17:24:50.421094200Z"},{"article_id":271,"rss_id":1,"title":"Alibaba's Jack Ma returns to China after year-long absence: Report","summary":"Once one of the country's most outspoken businessmen, he retreated from the public limelight in late 2020 after criticising China's regulatory system.","created_at":"2023-03-27T17:24:50.459970400Z"},{"article_id":272,"rss_id":1,"title":"Watch: Fuming Pakistan fan hurls abuses, caught body shaming Azam Khan in viral video during Afghanistan match","summary":"During Pakistan's loss in the second T20I vs Afghanistan, one fan was seen abusing and body shaming Azam Khan, who was dismissed for only one run off four balls.","created_at":"2023-03-27T17:24:50.498483Z"},{"article_id":273,"rss_id":1,"title":"Grimes and Elon Musk's daughter now has a new name. It may make you question 'why'","summary":"Recently, Grimes revealed that they had changed their daughter's name to a symbol.","created_at":"2023-03-27T17:24:50.535610700Z"},{"article_id":274,"rss_id":1,"title":"TN SSLC 2023 hall ticket awaited at dge.tn.gov.in","summary":"TN SSLC Hall Ticket 2023: Candidates can download it from dge.tn.gov.in, once released.","created_at":"2023-03-27T17:24:50.571230500Z"},{"article_id":275,"rss_id":1,"title":"Problematics | Swimmers’ meetings and Asimov’s pretty numbers","summary":"This week, we have challenging puzzles, one involving speed and distance and the other, a list by Isaac Asimov, giving both our puzzles a touch of unusualness. Good luck!","created_at":"2023-03-27T17:24:50.607911400Z"},{"article_id":276,"rss_id":1,"title":"SC seeks BJP MLA's response on Lokayukta’s plea against his anticipatory bail","summary":"The BJP MLA's son Prashanth Madal, who is the chief accounts officer of the Bangalore Water Supply and Sewerage Board, was arrested by the Lokayutka police on March 2 while allegedly receiving a bribe of  ₹40 lakh on behalf of his father at the KSDL office.","created_at":"2023-03-27T17:24:50.646167700Z"},{"article_id":277,"rss_id":1,"title":"Protests in Bihar House against Rahul Gandhi’s disqualification","summary":"Congress legislature party leader Ajeet Sharma raised the issue of disqualification and wanted a discussion on that first","created_at":"2023-03-27T17:24:50.678198700Z"},{"article_id":278,"rss_id":1,"title":"Tired of typing long WhatsApp messages? Feature to address this coming soon…","summary":"WhatsApp already allows people to record and send voice messages.","created_at":"2023-03-27T17:24:50.712766300Z"},{"article_id":279,"rss_id":1,"title":"Israeli protesters storm outside Netanyahu's residence over judicial reforms","summary":"Mass protests broke across Israel after Prime Minister Benjamin Netanyahu sacked Defence Minister Yoav Gallant, a day after he urged a halt to controversial judicial reforms. Hundreds gathered outside Netanyahu's residence in Jerusalem and raised slogans against the government. Clashes broke out in Tel Aviv as thousands hit the streets against the judicial overhaul. The Israeli President Isaac Herzog also called for an immediate halt to the judicial reform. Watch this video for details. ","created_at":"2023-03-27T17:24:50.749793300Z"},{"article_id":280,"rss_id":1,"title":"Rahul Gandhi needs to learn to differentiate between speaking & abusing: Meghwal","summary":"The BJP leader told Congress that freedom of speech and the use of foul words or abuses are two different things, and the Congress leader should be able to differentiate between the two","created_at":"2023-03-27T17:24:50.785208100Z"},{"article_id":281,"rss_id":1,"title":"Amritpal’s aide Varinder Singh in police net, sent to Dibrugarh jail","summary":"Police said Varinder Singh, a retired constable from the Indian Army, worked as a gunman for Waris Punjab De chief Amritpal Singh","created_at":"2023-03-27T17:24:50.823373Z"},{"article_id":282,"rss_id":1,"title":"Stay stylish: Check out top 7 Timex smartwatches in 2023","summary":"Are you looking for stylish smartwatches that are both reasonable and powerful? Check out our list of top 7 TIMEX smartwatches.","created_at":"2023-03-27T17:24:50.866658500Z"},{"article_id":283,"rss_id":1,"title":"OTTPlay ChangeMakers Awards: Guneet Monga steals attention, poses with Sayani Gupta","summary":"All from Guneet Monga, Sayani Gupta, Babil Khan to Rajkummar Rao and Priyanka Chahar Choudhary attended the OTTPlay ChangeMakers Awards 2023 in Mumbai on Sunday. See pics&nbsp;","created_at":"2023-03-27T17:24:50.910539400Z"},{"article_id":284,"rss_id":1,"title":"Hailey Bieber steps out with Justin Bieber on a brunch date amid Selena Gomez drama","summary":"Hailey Bieber was spotted enjoying a Sunday brunch date with singer-husband Justin Bieber in L.A. She is in the midst of an online drama with Selena Gomez","created_at":"2023-03-27T17:24:50.960207800Z"},{"article_id":285,"rss_id":1,"title":"Strike leads to grounding of flights at Israel's main airport","summary":"The strike was called on Monday by the country's largest trade union grouping and could paralyse large swaths of Israel's economy.","created_at":"2023-03-27T17:24:50.999238500Z"},{"article_id":286,"rss_id":1,"title":"Supreme Court to hear disqualified MP’s plea against delay in reinstating him","summary":"Disqualified NCP MP PP Mohammed Faizal complained to the Supreme Court that the Lok Sabha secretariat is yet to issue the order revoking his disqualification in view of the Kerala high court order staying his conviction","created_at":"2023-03-27T17:24:51.075572300Z"},{"article_id":287,"rss_id":1,"title":"Aerosmith frontman Steven Tyler turns 75","summary":"The face of the rock group Aerosmith, Steven Tyler, has been through many highs and lows. ","created_at":"2023-03-27T17:24:51.118437200Z"},{"article_id":288,"rss_id":1,"title":"PGCIL Recruitment: Apply for Engineer Trainee  posts through GATE 2023 scores","summary":"Power Grid Corporation of India Limited (PGCIL) will begin the application for Engineer Trainee through GATE 2023.","created_at":"2023-03-27T17:24:51.164440800Z"},{"article_id":289,"rss_id":1,"title":"Bihar woman, 24, went back home to Madhepura to prep for wedding, shot dead","summary":"The mother of the deceased said her daughter was the lone earning member of her family and she was to be married in May this year","created_at":"2023-03-27T17:24:51.198382800Z"},{"article_id":290,"rss_id":1,"title":"How to navigate through toxic relationship: 5 ways to prioritize your mental and emotional health ","summary":"Are you exhausted from trying to make a toxic or difficult relationship work? Check out five practical tips to help you cope with toxic relationships while empowering you to take control of your life. ","created_at":"2023-03-27T17:24:51.259245900Z"},{"article_id":291,"rss_id":1,"title":"Top 10 theatre projectors for perfect movie time: Buyer's guide","summary":"Make your movie nights amazing with the best projector for home theatre! Buy a projector online from this top 10 list.","created_at":"2023-03-27T17:24:51.286619100Z"}]